[
    {
        "start_date":"2009-01-20",
        "end_date":"",
        "category":"Proclamation",
        "facet":"Washington, DC",
        "content_text":"Proclaimed the National Day of Renewal and Reconciliation, and called on citizens to serve one another"
    },
    {
        "start_date":"2009-01-20",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Inauguration"
    },
    {
        "start_date":"2009-01-20",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Neighborhood Ball, Obama Home State Ball, Commander-in-Chief Ball, West/Southwestern Regional Ball, Midwestern Regional Ball, Eastern Regional Ball. (The official document says \"The President and Mrs. Bush\", though the former president and first lady were already in Texas.)"
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Freedom of Information Act memorandum reversing some Bush administration policies and directing agencies to presume that records are open unless precluded by law. It directed the Justice Department to change the policy within 45 days. (Signed 1/21; released 1/22; entered into Federal Register 1/23)"
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Ethics commitments in executive branch, requiring appointees to refuse lobbyist gifts and restricting hiring of registered lobbyists. It also restricted lobbying activity after leaving government. (Revolving door ban.) This was done in a ceremony in front of White House staff."
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Also called the Open Government Directive, this memo ordered chief technology officer and OMB to implement policies that would improve transparency, participation by citizens and collaboration."
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"A memorandum froze th pay of senior White House officials."
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Reverses the Bush administration policy on presidential records."
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Called President Mubarak of Egypt to address the fighting in Gaza."
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"National prayer service at the National Cathedral, with the Biden and Clinton families"
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"With vice president Biden, met with Robert M. Gates, Gen. Raymond T. Odierno, Gen. David H. Petraeus to discuss wars in Afghanistan and Iraq. Obama asked the leaders to start planning for \"a responsible military drawdown\" in Iraq."
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Do-over of the inaugural oath of office."
    },
    {
        "start_date":"2009-01-21",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama for America Staff Ball"
    },
    {
        "start_date":"2009-01-22",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Memorandum on review of the detention of Ali Saleh Kahlah al-Marri, the only enemy combatant held within the U.S. This memorandum ordered that his case be reviewed using similar guidelines as the Guantanamo Bay Executive order."
    },
    {
        "start_date":"2009-01-22",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"36th anniversary of Roe v. Wade, \"stands for a broader principle that Government should not intrude on our most private family matters. I remain committed to protecting a woman's right to choose.\""
    },
    {
        "start_date":"2009-01-22",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Interrogation procedures: This order revoked 13440, which was signed on July 20, 2007, and directing agencies to use a more narrow definition of \"torture\" and to follow the Army Field Manual for interrogations."
    },
    {
        "start_date":"2009-01-22",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Ordered a review of detention policies, creating a task force to recommend disposition of people captured during armed conflicts and counterterrorism operations."
    },
    {
        "start_date":"2009-01-22",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Ordered a review of all cases of people held at Guantanamo Bay, and work toward closing the prison \"as soon as practicable\", or within a year."
    },
    {
        "start_date":"2009-01-22",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Retired military officers"
    },
    {
        "start_date":"2009-01-22",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Hillary Clinton, Joe Biden, James L. Jones, Tom Donilon. At State, discussed three Executive orders on torture, Guantanamo Bay and a revew of the treatment terrorism suspects. Also announced George Mitchell as special envoy for Middle East peace; Richard Holbrooke as special representative for Afghanistan and Pakistan"
    },
    {
        "start_date":"2009-01-23",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Revoked the Reagan / Bush \"Mexico City Policy\" toward funding international non-profits that provide abortions with non-U.S. funds. (The policy had been recinded by Clinton, reinstated by George W. Bush.) In a related statement, Obama said he would \"initiate a fresh conversation\" on famiily planning issues in the \"coming weeks\""
    },
    {
        "start_date":"2009-01-23",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Bipartisan congressional leaders"
    },
    {
        "start_date":"2009-01-23",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Called Sen. Kirsten Gillibrand (D-NY), to congratulate her on the senate appointment, replacing Sec. Of State Hillary Rodham Clinton"
    },
    {
        "start_date":"2009-01-24",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"In promoting the stimulus plan, Obama made specific claims on clean energy, health care costs, education and other elements of the bills"
    },
    {
        "start_date":"2009-01-25",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Remarks on jobs, energy independence and climate change"
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Obama directed the EPA to review the Bush administration's decision to deny California the right of setting emission restrictions that are more strict than the federal level. (It effectively will reverse a Bush administration environmental policy) The memorandum was released the day after it was issued."
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"To implement the mileage standards in the Energy Independence and Security Act of 2007, Obama directed Transportation Department to finalize the rules by March 30 (18 months before the model year 2011 cars.)"
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Remarks surrounding executive actions regarding the EPA and energy: \"No single issue is as fundamental to our future than energy.\"  He said he would implement standards for model year 2011."
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"In the afternoon, in the Cabinet Room, the President met with Secretary of State Hillary;Rodham Clinton and the Presidents Special Envoy to the Middle East George J. Mitchell."
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Then, in the Map Room, he participated in an interview with Hisham Melhem of Al Arabiya;Television."
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"During the day, the President had separate telephone conversations with President;Dmitry A. Medvedev of Russia and"
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":", President Nicolas Sarkozy of France,"
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Chancellor Angela;Merkel of Germany,"
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":" President Luiz Inacio Lula da Silva of Brazil."
    },
    {
        "start_date":"2009-01-26",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"In the evening, the President participated in a swearing-in ceremony for Secretary of the;Treasury Timothy F. Geithner."
    },
    {
        "start_date":"2009-01-27",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Australian prime minister Kevin Rudd, about the economic crisis and cooperation on climate change, proliferation and other issues"
    },
    {
        "start_date":"2009-01-27",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Colombian president Uribe, about improving relations with Latin America and cooperation on narcotics, security, human rights"
    },
    {
        "start_date":"2009-01-27",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Allocated $20 million for humanitarian needs of Palestinian refugees and conflict victims in Gaza"
    },
    {
        "start_date":"2009-01-27",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Meeting with Republican lawmakers"
    },
    {
        "start_date":"2009-01-27",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Remarks on meeting with Republicans on jobs and recovery package"
    },
    {
        "start_date":"2009-01-27",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Installed Donovan (HUD), LaHood (Trans), Jackson (EPA), Rice (UN), Schapiro (SEC), Sutley (NEC)"
    },
    {
        "start_date":"2009-01-28",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Following Pentagon meeting, the president described hard choices ahead in Iraq and Afghanistan, and promised more support for the military, including their health. (Transcript available)"
    },
    {
        "start_date":"2009-01-28",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Following the House passage of the American Recovery and Reinvestment Act (ARRA, or stimulus package): promised it would \"save or create\" more than 3 million jobs, and would be administered with transparency and accountability \"never before seen in Washington\"."
    },
    {
        "start_date":"2009-01-28",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"South Africa president Motlanthe, partly about shared concerns over the situation in Zimbabwe and global financial issues."
    },
    {
        "start_date":"2009-01-28",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Called Arkansas governor Mike Beebe and Kentucky governor Steve Beshear about severe winter storms; declared state of emergency in both states"
    },
    {
        "start_date":"2009-01-28",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Met with 13 business leaders:  Steve Appleton,  Micron Technology;  David Barger, Jet Blue; ;Greg Brown Motorola; John Bryson, Edison International; David M. Cote, Honeywell;  Debra Lee, BET Holdings, Inc.;  Anne Mulcahy, Xerox;  Sam Palmisano, IBM; Antonio Perez, Eastman Kodak;  Eric Schmidt, Google; Michael Splinter, Applied Materials; ; Wendell Weeks, Corning;  Ron Williams, Aetna. Prior to meeting, Obama said that the business leaders were on the front lines of the economy, and had helped shape the stimulus package."
    },
    {
        "start_date":"2009-01-28",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Spoke following meeting with business leaders (transcript available). Obama spoke about his stimulus proposal and promised transparency to address skeptics."
    },
    {
        "start_date":"2009-01-28",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Pentagon, Gates, and service chiefs, with Joe Biden"
    },
    {
        "start_date":"2009-01-29",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Called Japan prime minister Aso. He expressed his commitment to the U.S.-Japan Alliance, discussed the global economic crisis, North Korea and six party talks."
    },
    {
        "start_date":"2009-01-29",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama issued a statement on the resignation of Rod Blagojevich"
    },
    {
        "start_date":"2009-01-29",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Motorcade of both Obamas to Sidwell Friends School."
    },
    {
        "start_date":"2009-01-29",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"Lilly Ledbetter act was signed, which reinstated the rights in bringing wage discrimination suits. (Transcript of signing remarks available)"
    },
    {
        "start_date":"2009-01-29",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Reception with ? Followed the sigining of the Lilly Ledbetter Fair Pay Restoration Act. People there included: House majority leader Steny Hoyer (D-Md.), Biden, Hillary Clinton, Sen. Patrick Leahy, House Speaker Pelosi, David Axelrod, Donna Brazile, . (President Obama attended, but it was hosted by Michelle)."
    },
    {
        "start_date":"2009-01-29",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Met with vice president Biden and treasury secretary Timothy Geithner. A transcript of the remarks is available, which focused on new regulatory tools, the stimulus package. He asked Wall Street to \"start acting in a more responsible fashion.\"  He said he supported the Steelers for the Super Bowl, citing the campaign support of owner Dan Rooney, who was later named ambassador to Ireland."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama praised the Senate for passing the children's health insurance measure"
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama called China president Hu Jintao, discussing an intent to \"build a more positive relationship\", the international financial crisis and global trade imbalances. They specifically mentioned credit markets, North Korea, Iran, Afghanistan, Pakistan, counterterrorism, proliferation and climate change"
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Created the White House Task Force on Middle-Class Working Families, to be headed by Joe Biden and to include other govenrment officials."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Requires agencies to include in contracts a provision that former contractors, if qualified, should be kept on when a new company wins a service contract."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Prevents federal contract costs related to influencing the formation of unions."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Remarks regarding reversal of federal contracting Executive orders: \"I also believe that we have to reverse many of the policies towards organized labor that we've seen these last 8 years, policies with which I've sharply disagreed\""
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Requires federal contractors to notify workers of rights under National Labor Relations Act."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Revoked George W. Bush Executive orders on regulatory planning and review. The provisions in this order have been reversed with each change in party since Reagan."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Spoke on the Middle Class Working Families Task Force, with vice president Biden. About 180 guests attended, including:  Sen. Frank Lautenberg, D-N.J.; Sen. Debbie Stabenow, D-Mich.; Sen. Sherrod Brown, D-Ohio; Sen. Jack Reed, D-R.I.; Gov. Brian Schweitzer of Montana; Rep. Dennis Kucinich, D-Ohio ; Christina D. Romer, chair, White House Council of Economic Advisers; Larry Summers, White House economic adviser; Christina M. Tchen, director of public liaison; John Sweeny, president of the AFL-CIO; James P. Hoffa, president of the Teamsters. At the event, Biden said: \"It's good to see so many of our friends from organized labor welcome back to the White House.\" He also said that the task force would operate with transparency."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Met with senior enlisted officials from the armed forces."
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"During the day, the President had separate telephone conversations with Prime Minister;Stephen Harper of Canada, King Abdallah bin Abd al-Aziz Al Saud of Saudi Arabia, Prime;Minister Gordon Brown of the United Kingdom, and Secretary-General Ban Ki-moon of the;United Nations. He also met with Treasury Secretary-designate Timothy F. Geithner"
    },
    {
        "start_date":"2009-01-30",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Called Missouri Gov. Jay Nixon and declared state of emergency"
    },
    {
        "start_date":"2009-01-31",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Congratulating Iraq on successful provincial elections."
    },
    {
        "start_date":"2009-01-31",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Weekly address focused on the stimulus plan and an upcoming plan by Treasury to address the credit crisis. Obama promised \"unprecedented transparency\" in the spending of any money."
    },
    {
        "start_date":"2009-01-31",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Matt Lauer, of the \"Today\" show, interviewed Obama about his first days as a family in the White House along with several policy issues."
    },
    {
        "start_date":"2009-01-31",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"In the evening, at the Capital Hilton Hotel, the President and Mrs. Obama attended the;Alfalfa Club dinner."
    },
    {
        "start_date":"2009-02-01",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama hosted a Super Bowl party, including these officials: Senator Bob Casey (D-PA);Senator Dick Durbin (D-IL);Senator Amy Klobuchar (D-MN);Senator Arlen Specter (R-PA); ;Congressman Elijah Cummings (D-MD);Congressman Artur Davis (D-AL);Congresswoman Rosa DeLauro (D-CT);Congressman Charlie Dent (R-PA);Congressman Mike Doyle (D-PA);Congressman Trent Franks (R-AZ);Congressman Raul Grijalva (D-AZ);Congressman Paul Hodes (D-NH);Congresswoman Eleanor Holmes-Norton (D-DC);Congressman Patrick Murphy (D-PA);Congressman Fred Upton (R-MI)"
    },
    {
        "start_date":"2009-02-01",
        "end_date":"",
        "category":"In-town event",
        "facet":"USA",
        "content_text":"The Vice President and Dr. Jill Biden will host members of the House and Senate, along with their families, at the Naval Observatory to watch the Super Bowl.  ;;The following elected officials will be guests at the Naval Observatory:;;Sen. Max Baucus;Sen. Tom Carper;Sen. Kent Conrad;Sen. John Kerry;Sen. Bill Nelson;Sen. Chuck Schumer;;Rep. Robert Brady;Rep. Jim Clyburn;Rep. Steny Hoyer ;Rep. John Larson"
    },
    {
        "start_date":"2009-02-02",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Later, he had separate telephone conversations with Prime Minister Nuri al-Maliki and President Jalal;Talabani of Iraq. (Iraq had an election on 1/31)."
    },
    {
        "start_date":"2009-02-02",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"From the pool report: \"The President and Vermont Gov. Jim Douglas, a Republican, spoke briefly to reporters in the Oval Office about the stimulus package. Transcript should be available. At the very end, a reporter asked the President if he stood behind HHS nominee Tom Daschle and Mr. Obama answered, \"Absolutely.\"\" This meeting appears nowhere in the presidential documents."
    },
    {
        "start_date":"2009-02-02",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Department of Education employees, as part of her \"get to know D.C. tour\"."
    },
    {
        "start_date":"2009-02-02",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Later, in the Roosevelt Room, he and Vice President;Biden met with congressional leadership to discuss financial legislation."
    },
    {
        "start_date":"2009-02-03",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama acknowledged areas of disagreement in his nomination of Republican Gregg for Secretary of Commerce, but said that they agreed on putting aside partisanship \"to embrace what works\""
    },
    {
        "start_date":"2009-02-03",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"A written statement accepting Daschle's decision to withdraw as nominee for the secretary of HHS"
    },
    {
        "start_date":"2009-02-03",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The Obamas visited the Capital City Public Charter School"
    },
    {
        "start_date":"2009-02-04",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Reversed Bush administration limits on the income caps states could set for the children's health insurance plans."
    },
    {
        "start_date":"2009-02-04",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"Obama argued that if Congress were to pass the stimulus plan, he would have accomplished more than previous administrations to improve health care"
    },
    {
        "start_date":"2009-02-04",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama announced new new restrictions on executive pay for companies taking federal help."
    },
    {
        "start_date":"2009-02-04",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Attended the Senate Democratic retreat at the Newseum"
    },
    {
        "start_date":"2009-02-04",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"A delegation from the U.S. Conference of Mayors went to the White House to meet senior staff. The president was with them only for the press event, apparently"
    },
    {
        "start_date":"2009-02-04",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Department of Housing and Urban Development visit, as part of \"get to know DC\" tour"
    },
    {
        "start_date":"2009-02-04",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The Obamas attended a caucus leadership cocktail party."
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Signed a disaster declaration for Kentucky following winter storms and flooding"
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Asked the Energy Department to move more quickly in establishing the appliance standards that had been legislated in 2005, but had not yet been published as regulations."
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Obama added people to the original Clinton order that established the National Economic Council"
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Added CTO, climate change adviser, director of science and technology, but eliminating (it seems) AIDS policy coordinator"
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Obama created the new panel to address the economic crisis."
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Speech on religion and its role in public life at the National Prayer Breakfast in the Capital Hilton, continuing a tradition started by President Eisenhower in 1953."
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"With Md. Gov. Martin O'Malley (D) and Sen. Benjamin Cardin (D) and Transportation secretary Roy LaHood, spoke at the Laurel, Md. MARC train station about the need for infrastructure spending and promoting the stimulus package"
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Obama changed the name of the office (to include neighborhood organizations) and added language to on equal protections, free exercise of religion and forbidding the establishment of religion. He also added language on accountability and transparency."
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama made an unexpected visit to the Energy Department, and gave a speech to the staff demanding passage of the stimulus bill"
    },
    {
        "start_date":"2009-02-05",
        "end_date":"",
        "category":"Remarks",
        "facet":"USA",
        "content_text":"Delivered speech encouraging passage of the stimulus bill to Democratic conference at Kingsmill Resort, Va."
    },
    {
        "start_date":"2009-02-06",
        "end_date":"",
        "category":"Remarks",
        "facet":"USA",
        "content_text":"Biden urged passage of the stimulus bill but also discussed Iraq and Afghanistan"
    },
    {
        "start_date":"2009-02-06",
        "end_date":"2009-02-08",
        "category":"Trip",
        "facet":"Europe",
        "content_text":"In Germany, Biden addressed the 45th Munich Conference, with Gen. James L. Jones, urging cooperation"
    },
    {
        "start_date":"2009-02-06",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"The order encourages employers to create project labor agreements across subcontractors."
    },
    {
        "start_date":"2009-02-06",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Declared a federal disaster in Arkansas following winter storms that began in January"
    },
    {
        "start_date":"2009-02-06",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"At the first meeting of the panel led by Paul Volcker, Obama urged passage of the stimulus bill and talked about a mounting economic crisis."
    },
    {
        "start_date":"2009-02-06",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Met with 40 family members and victims of the 9/11 and Cole attacks, saying that closing Guantanamo Bay would improve security and help bring terrorists to justice."
    },
    {
        "start_date":"2009-02-06",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The president and his family stayed until the end of the 2 1/4 hour performance"
    },
    {
        "start_date":"2009-02-07",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama said that Congress had \"responded appropriately\" the previous night to the economic crisis."
    },
    {
        "start_date":"2009-02-07",
        "end_date":"2009-02-08",
        "category":"Down time",
        "facet":"USA",
        "content_text":"According to Gibbs later on and in pool reports, the family, a friend of Sasha's, an unidentified friend of Michelle's family and Reggie Love."
    },
    {
        "start_date":"2009-02-08",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Angela Merkel, Germany; Donald Tusk, Poland; Yulia Tymoshenko, Ukraine; Sarkozy, France in separate meetings."
    },
    {
        "start_date":"2009-02-08",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Pres. Mikheil Saasashvili, Georgia; Deputy Prime Minister Ivanov, Russia;"
    },
    {
        "start_date":"2009-02-09",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Biden met with AFL-CIO president John J. Sweeney"
    },
    {
        "start_date":"2009-02-09",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Obama appointed Melissa Hathaway from the DNI to coordinate a 60-day review of government cyber-security activities"
    },
    {
        "start_date":"2009-02-09",
        "end_date":"2009-02-09",
        "category":"Trip",
        "facet":"USA",
        "content_text":"At Concord Community High School, Obama held a town hall meeting of about 1,500 people to promote the stimulus package. He was accompanied by members of Congress."
    },
    {
        "start_date":"2009-02-09",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Michelle Obama addressed Interior staff"
    },
    {
        "start_date":"2009-02-09",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-02-09",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama called Kevin Rudd to offer help and condolences in reaction to fires that broke out across Victoria, Australia"
    },
    {
        "start_date":"2009-02-10",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":"With Gov. Charlie Crist, Obama conducted a town hall meeting in Fort Myers to promote the stimulus, saying that the \"situation we face could not be more serious\""
    },
    {
        "start_date":"2009-02-10",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle visted Mary's Center, a community health center in Adams Morgan, D.C., giving, according to the pool, \"her own rendition of her husband's call for personal responsibility\" and promoting the stimulus bill."
    },
    {
        "start_date":"2009-02-10",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama met with the Democratic Blue Dog coalition in the State dining room"
    },
    {
        "start_date":"2009-02-10",
        "end_date":"",
        "category":"In-town event",
        "facet":"USA",
        "content_text":"Biden hosted 15 senators and their families"
    },
    {
        "start_date":"2009-02-11",
        "end_date":"2009-02-11",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Biden took the stimulus tour to Pennsylvania, visiting a bridge that needs fixing and meeting with Gov. Ed Rendell to speak to state legislators."
    },
    {
        "start_date":"2009-02-11",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle attended a panel at Howard University"
    },
    {
        "start_date":"2009-02-11",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Met with John Dingell (D) to mark the date that he became the longest-serving House member."
    },
    {
        "start_date":"2009-02-11",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Subjects included from Isreali elections, upcoming G20, energy, Middle East and economic crisis: Shimon Peres (Isreal),  Silvio Berlusconi (Italy), Asif Ali Zardari (Pakistan)"
    },
    {
        "start_date":"2009-02-11",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"Obama said postponing the date that all analog television would end was important because of the economic crisis, saying the most vulnerable would have lost their television signals."
    },
    {
        "start_date":"2009-02-11",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama, with Gov. Tim Kaine (D), visited a construction site in Springfield to promote the stimulus bill, calling the 1.3-mile segment of the Fairfax County Parkway a shovel-ready project."
    },
    {
        "start_date":"2009-02-11",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Thanked Congress for get the stimulus bill agreement."
    },
    {
        "start_date":"2009-02-11",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The Obamas attended the bicentennial birthday and re-opening of Ford's Theater. Obama told the story of Lincoln continuing construction on the Capitol during the war, despite shortages"
    },
    {
        "start_date":"2009-02-12",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Biden brought a presidential delegation to Boise, Idaho to watch the final found of figure skating and present medals. Others attending: Arne Duncan, Rep. Walt Minnick (D-Idaho), Susan Axelrod, Chester Finn, Ralph Cetrulo, Mark Shriver, Michelle Kwan and Scott Hamilton"
    },
    {
        "start_date":"2009-02-12",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama said the U.S. would support the special tribunal that was prosecuting the case of the assassination of Lebanese prime minister Rafiq Hariri four years earlier. He reiterated support of Lebanese independence."
    },
    {
        "start_date":"2009-02-12",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Gibbs, not Obama, offered a comment on the withdrawal of Sen. Judd Gregg (R-NH) as the nominee for Secretary of Commerce"
    },
    {
        "start_date":"2009-02-12",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Addressed members of congress on the 200th birthday of Abraham Lincoln. He repeated the previous night's story of Lincoln continuing construction of the Capitol during the Civil war."
    },
    {
        "start_date":"2009-02-12",
        "end_date":"2009-02-12",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Visited a Caterpillar plant in East Peoria and then attended the Abraham Lincoln Association Banquet in Springfield"
    },
    {
        "start_date":"2009-02-12",
        "end_date":"",
        "category":"Remarks",
        "facet":"USA",
        "content_text":"Obama called 22,000 layoffs at the company \"an urgent warning sign for America\""
    },
    {
        "start_date":"2009-02-12",
        "end_date":"",
        "category":"Remarks",
        "facet":"USA",
        "content_text":"Obama brought the talk around to the stimulus bill, and blamed reiterated personal responsibility theme."
    },
    {
        "start_date":"2009-02-13",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-02-13",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama urged passage of the stimlulus bill"
    },
    {
        "start_date":"2009-02-13",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama said he could not join the king on a visit to Pensacola. He sent Gen. James L. Jones instead to the Miami event."
    },
    {
        "start_date":"2009-02-13",
        "end_date":"2009-02-16",
        "category":"Down time",
        "facet":"USA",
        "content_text":"The Obamas spent the weekendat their Chicago home"
    },
    {
        "start_date":"2009-02-14",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama said that the passage of the stimulus bill would include unprecedented transparency"
    },
    {
        "start_date":"2009-02-14",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama taped a message to air on the following night during the NBA all-star game, urging fans to sign up at his campaign's usaservice.org website to promote community service projects"
    },
    {
        "start_date":"2009-02-15",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama declared a federal disaster in three states for winter storms, flooding and tornadoes."
    },
    {
        "start_date":"2009-02-16",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama called prime minister Recep Tayyip Ergodan and president Abdullah Gul of turkey."
    },
    {
        "start_date":"2009-02-17",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama approved a Defense request to send a Marine expeditionary brigade and an Army Stryker brigade this spring and summer to fight resurgent Taliban and to stabilize deteriorating condtions in Afghanistan"
    },
    {
        "start_date":"2009-02-17",
        "end_date":"2009-02-18",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Obama held events in Denver and Phoenix on the stimulus plan and on a plan for homeowners facing foreclosures"
    },
    {
        "start_date":"2009-02-17",
        "end_date":"",
        "category":"Meeting",
        "facet":"USA",
        "content_text":"Obama was asked about the Buy American clause in the stimulus bill and other trade issues, and on the role of Canada in Afghanistan"
    },
    {
        "start_date":"2009-02-17",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"USA",
        "content_text":"With Biden and Namaste Solar CEO Blake Jones, Obama toured the Denver Museum of Nature and Science's solar panel installation prior to the bill signing. The audience was made up of about 250 \"clean energy business leaders and community stakeholders.\""
    },
    {
        "start_date":"2009-02-17",
        "end_date":"",
        "category":"Bill signing",
        "facet":"USA",
        "content_text":"Calling the current conditions \"the greatest economic crisis in our lifetimes\", Obama said he inherited the \"deep and dire\" crisis and stressed accontability and transparency."
    },
    {
        "start_date":"2009-02-18",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"USA",
        "content_text":"With Geithner, Donovan, Bair, and four members of Congress, Obama outlined plan to address foreclosures at Dobson High School in Mesa. He said the plan would help avoid 7 million to 9 million foreclosures through restructuring or refinancing."
    },
    {
        "start_date":"2009-02-18",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle Obama invited school children to the White House for a concert by Sweet Honey in the Rock, \"an African American female a cappella ensemble\". During the event, she said Obama was making history every day, agreeing when an audience member said, \"because he's black.\""
    },
    {
        "start_date":"2009-02-19",
        "end_date":"2009-02-19",
        "category":"Trip",
        "facet":"Canada",
        "content_text":"Upon arrival in Ottawa, the President will meet with Governor General of Canada Michalle Jean in the Canada Reception Centre at the Ottawa International Airport. Following the meeting, he will travel to Parliament Hill, where he will be met by Prime Minister Stephen Harper and Parliament officials. They will hold a sit-down meeting in the Prime Ministers office and then have a working lunch. In the afternoon, the President and Prime Minister will hold a joint press availability, which will be open press. The President will then depart Parliament Hill and travel to the Ottawa International Airport, where he will meet with Leader of the Official Opposition Michael Ignatieff. Afterwards, he will meet with US Embassy employees and their families, before departing Ottawa to return to Andrews Air Force Base."
    },
    {
        "start_date":"2009-02-19",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"As part of the DC tour, Michelle visited the Agriculture Department to thank employees and presented a seedling magnolia tree."
    },
    {
        "start_date":"2009-02-20",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Obama extended the executive order that created an authority for helping the Gulf Coast following Katrina and Rita. It was originally to expire Feb. 28"
    },
    {
        "start_date":"2009-02-20",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Biden and Obama touted the stimulus package, and warned mayors to use the money wisely and promised to \"call them out\" to avoid wasteful spending. Duncan, Jarrett, Chu, LaHood, Holder, Donovan attended."
    },
    {
        "start_date":"2009-02-20",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Continuing the DC tour, Michelle visited the Transportation Department"
    },
    {
        "start_date":"2009-02-21",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama listed all of the things that passage of the stimulus bill would do, but said that stemming foreclosures, fixing the banking system, and closing deficits still had to be done."
    },
    {
        "start_date":"2009-02-21",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"President made an unscheduled trip to Kensington Parkwood Elementary school in Kensington, Md. to take in a basketball game by his daughter Sasha. Mrs. Obama and Malia also went along."
    },
    {
        "start_date":"2009-02-22",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle invited students from local cooking schools to visit the White House kitchen as staff prepared the NGA dinner."
    },
    {
        "start_date":"2009-02-22",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"2009 Governors' Dinner included performance by Earth, Wind and Fire."
    },
    {
        "start_date":"2009-02-23",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"During this event, Obama announced that Biden would be in charge of stimulus money, and named Earl Devaney as inspector general. Obama also announced that HHS would release $15 billion in Medicaid money to states on Feb. 25 in matching money"
    },
    {
        "start_date":"2009-02-23",
        "end_date":"2009-02-22",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Speakers included Mark Zandi of Moody's and Robert Greenstein of the Center of Budget and Policy Priorities. The subject: \"debate where we need to head\" in regards to the deficit. Groups included procurement policy, healthcare, Social Security,"
    },
    {
        "start_date":"2009-02-23",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama met with George Clooney, dubbed a United Nations Messenger of Peace, to discuss a recent visit to Chad. (This was not in pool, press lists.)"
    },
    {
        "start_date":"2009-02-24",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama, with Biden,  met with prime minister Taro Aso of Japan."
    },
    {
        "start_date":"2009-02-24",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama previewed his budget, which he said would require sacrafices in some worthy priorities. Pledged to cut the deficit in half by the end of the first term, and said he would eliminate wasteful spending, including ending agribusiness subsidies and some education programs that don't work."
    },
    {
        "start_date":"2009-02-25",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Listed money that was about to be approved (some from HHS, some from HUD), and stressed accountability. With Orszag and Devaney."
    },
    {
        "start_date":"2009-02-25",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"There are no details on this meeting of Democratic congressional leadership, which is only listed in the official schedule, not on the advance or press reports."
    },
    {
        "start_date":"2009-02-25",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama met with Geithner, Summers and the chairmen and ranking miniority members of the Senate Banking and the House Financial Services committees. Included were Bachus and Shelby (- R) and Dodd and Frank (-D). He laid out goals for a new regulatory framework."
    },
    {
        "start_date":"2009-02-25",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The Obamas held a party for Stevie Wonder the night before he was give the Gershwin lifetime achievement award from the Library of Congress. From the pool report: \"Love was in the air at the White House tonight, as the President and First Lady hosted a concert to honor Stevie Wonder, a man whose music they said brought them together.\""
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama said that the budget, while showing large deficits, was \"an honest accounting\" of the situation. He said he'd identified $2 trillion in deficit reductions, but only mentioned 20 million in Agriculture savings, $200 million in Interior, and $50 billion in overpayments of benefits or tax loopholes. Obama said he wouldn't sacrafice \"investments to make America stronger,\" outlining $15 billion in energy computerized health records and education"
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle continued her DC tour, this time visiting employees at EPA. From the pool: \" Mrs. Obama told the crowd they were about 1,000 large. She made brief remarks, got lots of applause, worked the rope line for a few minutes and was headed back to the White House. \""
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Meeting with Amb. Stephen W. Bosworth, special representative for North Korea policy"
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":" Fatmir Sejdiu, President of Kosovo along with Hashim Thaci, Prime Minister of Kosovo and Skender Hyseni, Foreign Minister of Kosovo"
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama met with the Bulls in the White House prior to their game against the Wizards"
    },
    {
        "start_date":"2009-02-26",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"The meeting with bipartisan congressional leaders was about his upcoming Iraq policy, which he would announce the next day at the Marine base Camp Lejeune in North Carolina"
    },
    {
        "start_date":"2009-02-27",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Assembled the first meeting of the Middle Class Task Force at the University of Pennsylvania Campus. Attending: Vilsack, Solis, Donovan, LaHood, Chu, Duncan, Melody Barnes. At the meeting, he said the first thing the group would do was evaluate how green jobs can help the middle class. He and his wife later made a stop in Delaware."
    },
    {
        "start_date":"2009-02-27",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Obama ended enemy combatant status for the only detaineed captured in the U.S., moving him to the jurisdiction of the Justice Department for prosecution"
    },
    {
        "start_date":"2009-02-27",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Rather than attend inperson, Obama taped remarks for the State of the Black Union event, promoting the recently passed stimulus bill as closing the health gap, the education gap and more."
    },
    {
        "start_date":"2009-02-27",
        "end_date":"2009-02-27",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Obama spoke to about 4,000 -- 300 civilians and the rest Marines from Camp Lejeune. Accompanied by Gates, Mullen, Jones, NC Gov. Bev Perdue.  He thanked the service members and outlined his plan for Iraq, promising to end combat missions by Aug. 31, 2010 and remove all U.S. troops by the end of 2011. He also promised a new GI bill and promising help to military families. Promised to raise miitary pay, provide quality child care, job training, expanded counseling and services."
    },
    {
        "start_date":"2009-02-27",
        "end_date":"",
        "category":"Call",
        "facet":"(in transit)",
        "content_text":"Obama called Nuri al-Maliki of Iraq to discuss plans to draw down U.S. forces while he was en route to the Marine base where he would announce the plan"
    },
    {
        "start_date":"2009-02-27",
        "end_date":"",
        "category":"Call",
        "facet":"USA",
        "content_text":"After arriving at Camp Lejeune, Obama called former president George W. Bush to brief him on his plans to draw down forces in Iraq."
    },
    {
        "start_date":"2009-02-27",
        "end_date":"",
        "category":"Meeting",
        "facet":"USA",
        "content_text":""
    },
    {
        "start_date":"2009-02-27",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Accompanied by Axelrod, Favreau, Reggie Love, and later Eric Whitaker.  Obama had courtside seats, but left briefly to visit the owners' box."
    },
    {
        "start_date":"2009-02-28",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Among the specific promises Obama said he had followed through on in the budget: fair and balanced tax code (cut taxes for 95%, raise on rich), caps on pollution, bring down cost of health care (\"with a historic commitment to reform that will lead to\") but says it addresses \"a stark reality\""
    },
    {
        "start_date":"2009-02-28",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Accompanied by Marty Nesbitt and Reggie Love (holding a basketball), Obama went to the Interior Department"
    },
    {
        "start_date":"2009-03-02",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle with Duncan, librarian of Congress, National Education Association president at the Library of Congress, on Dr. Seuss' 105th birthday."
    },
    {
        "start_date":"2009-03-02",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-03",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Obama told the Interior and Commerce Departments to review a Dec. 18, 2008 regulation that had eliminated some government agencies' reviews of threatened species."
    },
    {
        "start_date":"2009-03-03",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama promoted the stimulus bill in taped remarks to the AFL-CIO council, making promises of improvements in health care, infrastructure, renewable energy, education. He mentioned he signed two pieces of legislation on children's health and equal pay issues. (Biden attended the gathering in person March 5)"
    },
    {
        "start_date":"2009-03-03",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"The Obamas met Gordon Brown and his wife at the White House. (Obama also called him the next day to congratulate Brown on his Congress speech.)"
    },
    {
        "start_date":"2009-03-03",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Obama had to notify congress to continue to extend sanctions against Zimbabwe."
    },
    {
        "start_date":"2009-03-03",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama and Biden, at the Transportation Department, said that $28 billion in infrastructure money from the stimulus bill was released."
    },
    {
        "start_date":"2009-03-03",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama promoted parts of the stimulus bill that gave Interior $3 billion, including renewable energy on public lands, schools on Indian reservations, and improve drinking water in rural areas.  He also mentioned the memorandum signed earlier to reverse Bush policies on the Endangered Species Act"
    },
    {
        "start_date":"2009-03-03",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle toured the Women's Memorial and spoke to about 100 servicewomen chosen by the Pentagon"
    },
    {
        "start_date":"2009-03-04",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-04",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-04",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Memorandum reiterated a preference for competitive contracts and asked for a review of sole-source practices. He also directed officials to create new guidelines for outsourcing, saying the practice had, in recent years, taken over the proper role of federal employees. Obama said he would improve oversight, end unnecessary no-bid contracts, and maximize competition. He was joined by Sen. John McCain and other Democratic senators for the signing. Vilsack and Napolitano attended the signing to discuss changes in their departments' procurement."
    },
    {
        "start_date":"2009-03-04",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle visited Miriam's Kitchen, a soup kitchen seven blocks from the White House complex. The night before, she organized a food drive of eight cases of fruit, enough to last two weeks."
    },
    {
        "start_date":"2009-03-04",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"About 200 people at the White House, other guests included Orszag, Geithner, Emanuel"
    },
    {
        "start_date":"2009-03-05",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Five break-out sessions, each webcast on whitehouse.gov, included dozens of lawmakers and special interest groups to \"discuss ideas on how to bring down health care costs and increase coverage.\" Obama's remarks focused on deterioration in the past eight years."
    },
    {
        "start_date":"2009-03-05",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-06",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"Signed with little comment the bill to continue government funding"
    },
    {
        "start_date":"2009-03-06",
        "end_date":"2009-03-06",
        "category":"Trip",
        "facet":"USA",
        "content_text":"As part of the stimulus tour, Obama attended the Columbus police graduation exercises, saying that money in the stimulus bill saved the class's jobs, which were going to be eliminated. He also announced money for Savannah, Los Angeles and several other places. (Biden visited Miami that day as part of the stimulus tour)"
    },
    {
        "start_date":"2009-03-06",
        "end_date":"2009-03-07",
        "category":"Down time",
        "facet":"USA",
        "content_text":""
    },
    {
        "start_date":"2009-03-06",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The Obamas said they were attending a parent-teacher conference for Sasha at Sidwell"
    },
    {
        "start_date":"2009-03-07",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama discussed the \"inherited\" $1.3 trillion deficit, saying his budget starts making choices that \"we've avoided for too long\""
    },
    {
        "start_date":"2009-03-08",
        "end_date":"2009-03-08",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The Obamas made a cameo appearance at the Kennedy Center to see Sen. Edward M. Kennedy during a celebration of his birthday. Biden, John Kerry, Nancy Pelosi and Harry Reid were also in the presidential box. Bill Cosby was among the entertainers."
    },
    {
        "start_date":"2009-03-09",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Revokes the Bush administration's executive order, and the Bush statement of the same era that limited federal funding of stem cell research. Obama said that the Bush rule had \"no basis in science\" and was not required by any law"
    },
    {
        "start_date":"2009-03-09",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Obama ordered the Office of Science and Technology to \"develop a strategy for restoring scientific integrity to government decision making\""
    },
    {
        "start_date":"2009-03-09",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Obama outlined the conditions under which he would use signing statements. While not specifically invoking the Bush standard, he said that it was possible to abuse the practice.  He said he would \"strive to avoid the conclusion that any part\" of a bill was unconstitutional, and act with caution and restraint. He also directed agencies to consult with the Justice Department before acting on Bush signing statements"
    },
    {
        "start_date":"2009-03-09",
        "end_date":"2009-03-10",
        "category":"Trip",
        "facet":"Europe",
        "content_text":"Biden met with the North Atlantic Council to discuss Iraq and Afghanistan commitments and get their views for the strategic review. Also met with NATO, EU and other countries with an interest in the region"
    },
    {
        "start_date":"2009-03-09",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-10",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Saying that workers without college degrees - and Latinos most of all - bear the brunt of layoffs, Obama criticized the past decades of \"stale debates\" over education policy. He criticized the Republican Party, then said that the time for finger-pointing is over. This speech promoted his budget, saying he is investing in education and eliminating programs that don't work. He promoted more charter schools and self-responsibility as well. Valerie Jarrett, Duncan and Solis were at the event at the Marriott Washington Metro Center."
    },
    {
        "start_date":"2009-03-10",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"On the way back from the event at the Marriott, Obama stopped at the organization at the Westin City Center. He spoke for about 4 minutes at the roundtable, about funding education reforms and ending programs that don't work. With Duncan."
    },
    {
        "start_date":"2009-03-10",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-10",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"With Clinton, Susan Rice and Lynn Pascoe, talked about Afghanistan, the economic crisis in poor and developing countries, Haiti, Darfur, climate change"
    },
    {
        "start_date":"2009-03-11",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"In signing the appropriations bill for the remainder of the 2010 fiscal year, Obama issued his first signing statement objecting to limits on peacekeeping missions, negotiations with other countries. He also objected to provisions that would have effectively prohibited gag rules on employees in their communications with Congress. He also said that if he finds earmarks with \"no legitimate public purpose\", his administration would try to eliminate it. He asked Congress to improve earmark processes."
    },
    {
        "start_date":"2009-03-11",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-11",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"The press office withheld this notice for a day. Obama continued a national emergency declaration regarding Iran, saying it still posed \"an unusual and extraordinary threat.\""
    },
    {
        "start_date":"2009-03-11",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Wide-ranging questions included the drug war on the Mexican border, new industries for the Rust Belt, education, biofuels and the stimulus."
    },
    {
        "start_date":"2009-03-11",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle, with Hillary Clinton, presented Secretary of State's Award for International Courage, celebrating International Women's Day"
    },
    {
        "start_date":"2009-03-11",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Obama created a White House organization to take into account the needs of women and girls in the policies they draft"
    },
    {
        "start_date":"2009-03-12",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"About 125 state officials went to the White House for presentations by federal officials on how the stimulus money would be distributed. Obama and Biden said they would write regulations around the bill to restrict the money more than the law requires. During the meeting, Earl Devaney said it would take at least a year to get recovery.gov working properly for transparency."
    },
    {
        "start_date":"2009-03-12",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Michelle traveled to Fayetteville, N.C. She first met with military spouses to talk about family support services, then with community organizers about those services."
    },
    {
        "start_date":"2009-03-12",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"About 900 uniformed and civilian personnel attended the dedication of Abraham Lincoln building at Fort McNair. Obama mentioned global threats, the need for allies and the complex missions of the military."
    },
    {
        "start_date":"2009-03-12",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Discussed: bilateral relations, economic crisis, North Korea, Afghanistan, Pakistan and Sudan. Obama told Jiechi that promotion of human rights was part of U.S. policy and mentioned the Dalai Lama"
    },
    {
        "start_date":"2009-03-12",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama promoted his stimulus plans for infrastructure, green jobs and lower health care costs. He said he believed in the free market, but that it had fallen out of balance. About 60 CEOs of major corporations were expected to attend (list published by White House) With Arne Duncan, Carol Browner."
    },
    {
        "start_date":"2009-03-13",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"With Volcker, began changing the focus from the stimulus bill to the financial markets"
    },
    {
        "start_date":"2009-03-13",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Arroyo, Phillippines; Yudhoyono, Indonesia; Abdullah, Saudi Arabia; Fernandez de Kirchner, Argentia. General discussion topics included terrorism, global financial crisis."
    },
    {
        "start_date":"2009-03-14",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"To \"discuss ways in which the two countries can strengthen cooperation on global and hemispheric challenges.\" Summers, Jones, Steinberg and Restrepo were also there."
    },
    {
        "start_date":"2009-03-14",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"On the theme of food safety, Obama announced the appointment of FDA officials and the creating of a new food safety group. He said the Agriculture Department would close a loophole in meat processing and would increase the number of FDA inspectors"
    },
    {
        "start_date":"2009-03-16",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama met with about a dozen small business owners and lenders, joined by Geithner, members of Congress involved in small business committees. Geithner outlined bailout funds used to stimulate credit and lending. At the conference, Obama chastised AIG for the bonuses"
    },
    {
        "start_date":"2009-03-16",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"On the 20th anniversary of becoming a cabinet agency, Obama promised to increase its budget and implement a new GI bill"
    },
    {
        "start_date":"2009-03-17",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"President of U.S. Conference of Catholic Bishops, and the archbishop of Chicago"
    },
    {
        "start_date":"2009-03-17",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama met with Conrad (D-ND) and Spratt on the budget. After the meeting, Obama talked about the \"shenanigans\" on Wall Street, health care, education, energy in promoting his budget blueprint."
    },
    {
        "start_date":"2009-03-17",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle spoke to about 100 AmeriCorps members, who were building an energy-efficient home on the Mall"
    },
    {
        "start_date":"2009-03-17",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Brian Cowan, Taoiseach of Ireland, Northern Ireland First Minister Peter Robinson and Northern Ireland Deputy First Minister Martin McGuinness"
    },
    {
        "start_date":"2009-03-17",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama went to the Capitol to speak at the House leader's St. Patrick's Day lunch, the focus was peace in Ireland."
    },
    {
        "start_date":"2009-03-17",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"George Mitchell, Obama's special envoy to the Middle East and the negotiator of the Good Friday agreement, Richard Daley of Chicago, Martin O'Malley of Maryland, other Irish Americans."
    },
    {
        "start_date":"2009-03-17",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"At the Corcoran, Biden told donors that Obama had inherited the most difficult first 100 days of any president, including Roosevelt. He promoted the budget and asked for their help to get it passed. He mentioned health care, energy and fiscal discipline. Kaine announced Organizing for America out of the DNC"
    },
    {
        "start_date":"2009-03-18",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Biden hosted local officials with Earl Devaney and other officials on the implementation of the stimulus bill. Devaney said that the transparency and data collection would have to be figured out."
    },
    {
        "start_date":"2009-03-18",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama called the president-elect of el Salvador."
    },
    {
        "start_date":"2009-03-18",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama urged Congress to finish the GIVE Act and its companion bill, called the Serve America Act"
    },
    {
        "start_date":"2009-03-18",
        "end_date":"2009-03-20",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Obama held a town hall at the Orange County Fairgrounds, toured an electric vehicle technical center, held another town hall in LA, and was on the Tonight show"
    },
    {
        "start_date":"2009-03-18",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"USA",
        "content_text":"Obama criticized AIG bonuses, promoted the stimulus bill and outlined financial bailout goals. As part of the promotion, the White House released what it said was a list of funding for California under the first 30 days of the stimulus bill."
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Biden brought the stimulus tour to the New Flyer of America Bus, St. Cloud, Minn. and announced a new website www.AStrongMiddleClass.gov for the task force. The choice of New Flyer was because it will purportedly be helped by public transit funding. The company makes low-emission vehicles. With Arne Duncan, Donovan, LaHood,Vilsack"
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michelle held a round table with students at Anacostia High School in recognition of Women's History Month (Earlier in the day, she hosted 21 women who were going to other schools that day and had a dinner with them and about 100 high-school girls later on)"
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"Obama signed a simple extension of the authority for SBA, which was about to run out. There is nothing substantive in it."
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama covered his plans for immigration reform and announced his visit to Mexico in April"
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"USA",
        "content_text":"Obama toured the center and announced $2.4 billion in funding for electric vehicles funded by the stimulus bill"
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Responding to outrage over bonuses at taxpayer-supported AIG, Obama called the bonuses \"outrageous\" and an inappropriate use of taxpayer money."
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"USA",
        "content_text":"With Arnold and Maria Shriver, promoted the stimulus bill and the housing plan. He announced the tax deduction for buying a home, and criticized AIG bonuses"
    },
    {
        "start_date":"2009-03-19",
        "end_date":"",
        "category":"Meeting",
        "facet":"USA",
        "content_text":"Obama said he was \"stunned\" over the AIG bonuses, and about the House bill to return 90 percent of them. He said people who are doing well should \"pay a little more\" and promoted new regulations on financial products"
    },
    {
        "start_date":"2009-03-20",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"With students from Bancroft Elementary School, Michelle broke ground on the WHite House garden"
    },
    {
        "start_date":"2009-03-20",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"As part of the message about the Iranian holiday, Obama said he wanted partnerships and commerce."
    },
    {
        "start_date":"2009-03-20",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Among the instructions: non-political funding of projects; restrictions on communications with lobbyists; methods of avoiding \"imprudent\" projects"
    },
    {
        "start_date":"2009-03-20",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama spoke to the National Conference of State Legislatures about transparency, oversight and infrastructure in stimulus bill. (This was actually EOB, not the White House)"
    },
    {
        "start_date":"2009-03-20",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Billed as the \"Meeting on Building Amerca's Future,\" Obama called the trio the most innovative elected officials in the country. He promoted the stimulus bill, his budget and highway reauthorization"
    },
    {
        "start_date":"2009-03-20",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-21",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama laid out principles for the budget: energy independence, education, health care reform"
    },
    {
        "start_date":"2009-03-21",
        "end_date":"2009-03-22",
        "category":"Down time",
        "facet":"USA",
        "content_text":"Obama had been scheduled to return Monday, but at 10:30 on Sunday night, the pool was alerted that he would be back that night. He came back alone"
    },
    {
        "start_date":"2009-03-21",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-23",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"UK prime minister Gordon Brown and Obama talked about G20 meeting, international financial crisis and Iran and Afghanistan and Pakistan."
    },
    {
        "start_date":"2009-03-23",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-23",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"With Bernanke and Geithner, Obama (Biden, Emanuel and Orszag) revived the three legs of the stool comparison, saying Treasury was that day releasing details of one of them. (This was the plan to get rid of toxic assets) Part of Geithner's presentation was about foreclosures."
    },
    {
        "start_date":"2009-03-23",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-23",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"With John Holdren, Browner, Sutley with MIT president, Serious Materials and others, Obama promoted the clean energy portions of the stimulus bill and announced $1.2 billion for research through Energy's national laboratories."
    },
    {
        "start_date":"2009-03-24",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-24",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"With DC middle-school students, Sen. Bill Nelson (a former astronaut), Holdren and Sen Kay Bailey Hutchison, Obama called the astronauts. He asked about the solar panels on the space station, saying he was particularly interested in it on Earth."
    },
    {
        "start_date":"2009-03-24",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"After the meeting, Obama said that there should be more regulation of hedge funds and non-bank financial companies (like AIG)."
    },
    {
        "start_date":"2009-03-24",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama stressed the budget; questions were focused on financial crisis, AIG bonuses, regulation of financial institutions and the budget deficit"
    },
    {
        "start_date":"2009-03-25",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Preparations for G20,  Afghanistan and Russia"
    },
    {
        "start_date":"2009-03-25",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-25",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Unexpectedly, Obama participated in wreath-laying ceremony for National Medal of Honor Day"
    },
    {
        "start_date":"2009-03-25",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"About 180 guests for the White House reception for Greek Independence Day, including former Md. Sen. Sarbanes, Chris Van Hollen, Orszag."
    },
    {
        "start_date":"2009-03-25",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"One was $30,400 per couple at the National Women in the Arts Museum. Later, a much larger event at the Warner Theater, where tickets were $150 to $1,000. Obama mainly promoted his budget plan. He hit the themes of education, clean energy and health care"
    },
    {
        "start_date":"2009-03-26",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Biden hosted the conference, at which he announced the latest spending: Social Security payments, and $3.2 billion for state and local energy efficiency and conservation programs. Cabinet members were Chu, Shineski, Vilsack, with Orszag."
    },
    {
        "start_date":"2009-03-26",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-26",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-26",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-26",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-26",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"His remarks hit familiar themes: success of the stimulus bill, help for foreclosures, education, clean energy, health care. He also said that car manufacturers should expect to reorganize."
    },
    {
        "start_date":"2009-03-27",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama invited leaders of 16 countries to the State Department in April to prepare for a meeting in Italy in July for the Major Economies Forum on Energy and Climate Change"
    },
    {
        "start_date":"2009-03-27",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"With USAID administrator, Petreaus, Clinton, Holbrooke and about a dozen people who had recently returned from the region, Obama called the situation in Afghanistan perilous. He announced 17,000 more troops and an increase in civilian effort."
    },
    {
        "start_date":"2009-03-27",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama spoke briefly at a purely ceremonial installation of Eric Holder as attorney general -- he had already been sworn in."
    },
    {
        "start_date":"2009-03-27",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama met with CEOs of 14 major financial institutions, but not AIG."
    },
    {
        "start_date":"2009-03-27",
        "end_date":"2009-03-29",
        "category":"Down time",
        "facet":"USA",
        "content_text":""
    },
    {
        "start_date":"2009-03-30",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-03-30",
        "end_date":"2009-04-08",
        "category":"Trip",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-03-30",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama said the restructuring plan put out by GM was not enough and said Chrysler had to find a partner before either one would get more government money.He also announced the warranty program from the government"
    },
    {
        "start_date":"2009-03-30",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"Salazar and western lawmakers were at the bill signing. The law consolidated 150 original bills, creating new wildlife areas and other projects. Obama issued a signing statement objecting to requirements to appoint members of a commission based on congressional recommendations"
    },
    {
        "start_date":"2009-03-30",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama said he wanted to address the immediate crisis of NGOs being expelled from Sudan by sending Gration to the region. The attendees included activists from the Save Darfur Coalition."
    },
    {
        "start_date":"2009-03-30",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"With Orszag and Emanuel, Obama sold his budget as a distillation of Democratic values, urging members to support it."
    },
    {
        "start_date":"2009-03-30",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"The pool report said it was unclear whether this event at the Washington Court Hotel was a fundraiser, but the unscheduled stop was to pay tribute to Rep. Dave Obey. (There is an invitation to this event on Politcal Party Time, saying tickets ranged from $1,000 to $5,000)."
    },
    {
        "start_date":"2009-03-31",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama discussed the international financial crisis"
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Call",
        "facet":"Europe",
        "content_text":"Obama congratulated Netanyahu on his swearing in."
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":""
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Reaffirming \"special relationship\", and mutual thanks"
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"With the ending of the START treaty, the officials said they would work toward replacing it with a new agreement."
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Hu and Obama agreed to dispatch Clinton, Geithner and their counterparts for a \"strategic and economic dialogue\"."
    },
    {
        "start_date":"2009-04-01",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-02",
        "end_date":"",
        "category":"Remarks",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-02",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-02",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Discussed North Korea, and supported the six-party talks. Obama and Lee also discussed the free trade agreement."
    },
    {
        "start_date":"2009-04-02",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Obama said that all G20 nations had agreed on stimulus, totaling $2 trillion and tripling IMF lending. Also addressed regulatory systems,"
    },
    {
        "start_date":"2009-04-02",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-02",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-03",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"In Strasbourg, Obama met with Sarkozy. The leaders discussed Afghanistan, NATO, Iran, Russia and the Middle East"
    },
    {
        "start_date":"2009-04-03",
        "end_date":"",
        "category":"Remarks",
        "facet":"Europe",
        "content_text":"Obama opened with comments on pollution, global economy.  Lots of questions on energy and environment"
    },
    {
        "start_date":"2009-04-03",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-04",
        "end_date":"",
        "category":"Remarks",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-04",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-04",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Europe",
        "content_text":"NATO officials walked across the bridge connecting France and Germany, then paid tribute to assembled NATO troops."
    },
    {
        "start_date":"2009-04-04",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Welcomed Albania and Croatia to the council. The meeting was mainly about Afghanistan. Obama got a commitment for 5,000 troops and more civilian support."
    },
    {
        "start_date":"2009-04-04",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-05",
        "end_date":"",
        "category":"Remarks",
        "facet":"Europe",
        "content_text":"Obama said he would consult with allies and urged North Korea to work in the six-party talks"
    },
    {
        "start_date":"2009-04-05",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":"Rather than talk about the meeting, Obama addressed the North Korea launch. He hit familiar themes in a related speech, but added some material on nonproliferation. They discussed NATO, climate change, Afghanistan and missile defense"
    },
    {
        "start_date":"2009-04-05",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-05",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-05",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-05",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-05",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-06",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Middle East",
        "content_text":""
    },
    {
        "start_date":"2009-04-06",
        "end_date":"",
        "category":"Meeting",
        "facet":"Middle East",
        "content_text":""
    },
    {
        "start_date":"2009-04-06",
        "end_date":"",
        "category":"Remarks",
        "facet":"Middle East",
        "content_text":"Obama reiterated U.S. support of Turkey joining EU, mentioned human rights progress in Turkey, Middle East. He said that he would not let the U.S. relationship with the Islamic world be defined by al Qaeda."
    },
    {
        "start_date":"2009-04-06",
        "end_date":"",
        "category":"Meeting",
        "facet":"Middle East",
        "content_text":""
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Call",
        "facet":"(in transit)",
        "content_text":""
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Call",
        "facet":"(in transit)",
        "content_text":"Called the leader of Azerbaijan to stress Turkey-Armenian peace."
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Remarks",
        "facet":"(in transit)",
        "content_text":""
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Meeting",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Europe",
        "content_text":""
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Europe",
        "content_text":"Included Turkish university students, Americans from State Department programs, and some international students studying in Turkey."
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Out-of-town event",
        "facet":"Middle East",
        "content_text":"Obama took a detour on his way home from Turkey to go to Iraq, and was briefed by Gen. Odierno."
    },
    {
        "start_date":"2009-04-07",
        "end_date":"",
        "category":"Meeting",
        "facet":"Middle East",
        "content_text":""
    },
    {
        "start_date":"2009-04-08",
        "end_date":"",
        "category":"Executive order",
        "facet":"Washington, DC",
        "content_text":"Obama created the health-care-reform tsar office in the White House"
    },
    {
        "start_date":"2009-04-08",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Congratulating Carolina on NCAA victory, and for \"vindicating\" Obama's pick"
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Michele hosted Bancroft Elementary school students, and Vilsack, in planting the White House garden"
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"As part of the budget plan, Obama said that he would fully fund the services, increase funding for medical care and increase in child and spousal care in the military. In Veterans Affairs, he promised to increase funding."
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"The WHite House released a statement saying that, on March 30, Obama directed the admin to speed up the purchase of vehicles."
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"For winning the women's NCAA title."
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama asked Congress for $83 billion more for FY 2010 for Iraq and Afghanistan, saying he would include the needs in his regular budget requests"
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"Continuing  a practice begun by Bill Clinton, Obama signed a waiver from a law that banned office of the PLO in the U.S."
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama discussed the upcoming Summit of the Americas"
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama showcased families who had refinanced, and tried to talk up mortgage market and Making Home Affordable plan, targeting borrowers in Freddie Mac and Fannie Mae.  (Program was announced Feb. 18)"
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Biden announced another $2 billion in availability for vaccines and other children support programs. He said this was a weekly meeting."
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-09",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-10",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Obama was also joined by regulatory officials and SEC chairman Mary Shapiro. He reviewed efforts, including SBA funding (up 20 percent in one month, he said) and housing plans."
    },
    {
        "start_date":"2009-04-10",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama called Mills for his inauguration, discussed narcotics trade in West Africa."
    },
    {
        "start_date":"2009-04-10",
        "end_date":"",
        "category":"Call",
        "facet":"Washington, DC",
        "content_text":"Obama discussed the global financial crisis and the upcoming summit"
    },
    {
        "start_date":"2009-04-11",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-12",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"The Obamas went to Jarrett's Georgetown home for Easter dinner"
    },
    {
        "start_date":"2009-04-12",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-13",
        "end_date":"",
        "category":"Memorandum",
        "facet":"Washington, DC",
        "content_text":"In advance of the Summit of the Americas, Obama lifted some restrictions on family travel and remittences to Cuba, and opened up U.S. telecom."
    },
    {
        "start_date":"2009-04-13",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-13",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama and Biden claimed that they had funded the 2,000th transportation project under the stimulus bill. They said most projects were coming in under budget."
    },
    {
        "start_date":"2009-04-14",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"In the \"New Foundation\" speech, Obama reviewed the already announced elements of the economic recovery plan, including the stimulus bill, bank bailout, the auto plan and G20 to get credit flowing and increase demand. He said there were hard decisions to be made, but didn't list any."
    },
    {
        "start_date":"2009-04-14",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-15",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama named three Mexican organizations \"drug kingpins,\" meaning they cannot use U.S. financial institutions and face other penalties."
    },
    {
        "start_date":"2009-04-15",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama met with families on tax day, saying that this tax cut in the stimulus bill was helping them. The White House itemized several other tax benefits in the bill, such as first-time homebuyer, college costs, health insurance and earned income tax credit"
    },
    {
        "start_date":"2009-04-16",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama said he was acting on a promise he made at G20 to increase borrowing authority 10-fold, to $550 billion. The US would provide $100 billion. It does not increase spending, just changes it."
    },
    {
        "start_date":"2009-04-16",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":"Biden visited a factory that makes transformers for wind turbines and said their jobs were saved because Lost Creek Wind Farm got stimulus money. He also did an event with troops at Whitman Air Force base, home of the B-2 bomber"
    },
    {
        "start_date":"2009-04-16",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama promoted high-speed rail as a green initiative and said his plan was a first step. With LaHood, Biden, state and local transportation officials, transportation advocacy groups. He identified $8 billion in stimulus bill and $1 billion more a year in budget request."
    },
    {
        "start_date":"2009-04-16",
        "end_date":"2009-04-19",
        "category":"Trip",
        "facet":"Caribbean",
        "content_text":"Obama was joined by Chu (Energy), Larry Summers, deputy national security advisor McDonough"
    },
    {
        "start_date":"2009-04-16",
        "end_date":"",
        "category":"Trip",
        "facet":"Mexico",
        "content_text":"From the Post: President Obama and his Mexican counterpart, Felipe Caldern, outlined a common approach Thursday to combating drug violence, climate change and trade disputes but appeared to part ways over the urgency of reinstating a U.S. ban on assault weapons."
    },
    {
        "start_date":"2009-04-17",
        "end_date":"",
        "category":"Meeting",
        "facet":"Caribbean",
        "content_text":"I don't have the list right now - have to get it"
    },
    {
        "start_date":"2009-04-18",
        "end_date":"",
        "category":"Meeting",
        "facet":"Caribbean",
        "content_text":""
    },
    {
        "start_date":"2009-04-18",
        "end_date":"",
        "category":"Remarks",
        "facet":"Caribbean",
        "content_text":"Announced the formation of the Multilateral Investment Fund, with $100 million."
    },
    {
        "start_date":"2009-04-18",
        "end_date":"",
        "category":"Meeting",
        "facet":"Caribbean",
        "content_text":"No list, headed by Bachelet, Chile"
    },
    {
        "start_date":"2009-04-18",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama said they had started \"scouring\" the budget line by line, looking for obsolete or ineffective programs and said he would announce the elimination of dozens of programs in the coming weeks (pre-taped)"
    },
    {
        "start_date":"2009-04-19",
        "end_date":"",
        "category":"Meeting",
        "facet":"Caribbean",
        "content_text":""
    },
    {
        "start_date":"2009-04-19",
        "end_date":"",
        "category":"Meeting",
        "facet":"Caribbean",
        "content_text":""
    },
    {
        "start_date":"2009-04-20",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"With Sebelius not yet confirmed, Obama met with all but one of his cabinet. Obama laid out symbolic budget cuts already made: 26 conferences at VA, combining employees in Ag, $52 million in savings from buying office supplies in bulk. Said Orszag was going line by line in the budget, and they expected to cut more than 100 programs in the next few weeks."
    },
    {
        "start_date":"2009-04-20",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama told the employees that they had his full support and said the release was peculiar since so much had already been made public."
    },
    {
        "start_date":"2009-04-21",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":"Along with the peace process in the Middle East, they also discussed Iran, Afghanistan, terrorism. During the Q&A, he opened the door to prosecutions for terrorism"
    },
    {
        "start_date":"2009-04-21",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Wesley Brown, the first black graduate of the academy, was on hand for the football trophy presentation"
    },
    {
        "start_date":"2009-04-21",
        "end_date":"",
        "category":"Bill signing",
        "facet":"Washington, DC",
        "content_text":"Obama signed the bill at the Seed School, surrounded by Bill Clinton, Rosalynn Carter, Colin Powell, Michael Bloomberg, Carolyn Kennedy. It expands AmeriCorps to 250,000 by 2017 and adds programs that they can serve in, including health and clean energy. (He met with Kennedy and Clinton just before the event)"
    },
    {
        "start_date":"2009-04-22",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":""
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"List is available from press secy"
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"Obama got a football jersey and a football from the NCAA champions."
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":"She said this year's theme was on community service, and described public sector workers as \"public servants\" and how much the White House honors them. She said she snuck out of the White House sometimes to go out to eat with her staff."
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"Remarks",
        "facet":"Washington, DC",
        "content_text":"Obama told them he supported credit cards but that Congress was going to reform some of what he called abuses and that his goal was clarity and transparency in the agreements. With Geithner, Summers (who fell asleep), Jarrett, Emanuel, Sperling. The ABA and most CEOs of large credit card companies were there."
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"Meeting",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-23",
        "end_date":"",
        "category":"In-town event",
        "facet":"Washington, DC",
        "content_text":""
    },
    {
        "start_date":"2009-04-29",
        "end_date":"",
        "category":"Trip",
        "facet":"USA",
        "content_text":""
    }
]
