[
    {
        "start_date":"1775",
        "end_date":"1783",
        "content_text":"American Revolutionary War: an armed struggle for secession from the British Empire by the Thirteen Colonies that would subsequently become the United States.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1776",
        "end_date":"1777",
        "content_text":"Second Cherokee War: a series of armed conflicts when the Cherokee fought to prevent the encroachment of American settlers into eastern Tennessee and eastern Kentucky; under British rule, this land had been preserved as native territory.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1776",
        "end_date":"1794",
        "content_text":"Chickamauga Wars: a continuation of the Second Cherokee War that included a larger number of native tribes attempt to halt the expansion of settlers into Kentucky and Tennessee.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1785",
        "end_date":"1795",
        "content_text":"Northwest Indian War: a series of battles with various native tribes in present-day Ohio.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1786",
        "end_date":"1787",
        "content_text":"Shays' Rebellion: a Western Massachusetts debtor's revolt over a credit squeeze that had financially devastated many farmers.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1791",
        "end_date":"1794",
        "content_text":"Whiskey Rebellion: a series of protests against the institution of a federal tax on the distillation of spirits as a revenue source for repaying the nation's war bonds.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1798",
        "end_date":"1800",
        "content_text":"Quasi-War: an undeclared naval war with France over American default on its war debt.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1799",
        "end_date":"1800",
        "content_text":"Fries' Rebellion: a string of protests against the enactment of new real estate taxes to pay for the Quasi-War.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1801",
        "end_date":"1805",
        "content_text":"First Barbary War: a series of naval battles in the Mediterranean against the Kingdom of Tripoli, a quasi-independent state of the Ottoman Empire.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1806",
        "end_date":"",
        "content_text":"Action in Spanish Mexico: The platoon under Captain Zebulon Pike invaded Spanish territory at the headwaters of the Rio Grande on orders from General James Wilkinson.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1806",
        "end_date":"1810",
        "content_text":"Action in the Gulf of Mexico: American gunboats operated from New Orleans against Spanish and French privateers off the Mississippi Delta, chiefly under Captain John Shaw and Master Commandant David Porter.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1810",
        "end_date":"",
        "content_text":"West Florida (Spanish territory): Governor William C. C. Claiborne of Louisiana, on orders of President James Madison, occupied with troops territory in dispute east of the Mississippi as far as the Pearl River, later the eastern boundary of Louisiana.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1812",
        "end_date":"",
        "content_text":"Amelia Island and other parts of east Florida, then under Spain: Temporary possession was authorized by President James Madison and by Congress, to prevent occupation by any other power; but possession was obtained by General George Mathews in so irregular a manner that his measures were disavowed by the President.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1812",
        "end_date":"1815",
        "content_text":"War of 1812: On June 18, 1812, the United States declared war against the United Kingdom.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1813",
        "end_date":"1814",
        "content_text":"Marquesas Islands (French Polynesia): U.S. forces built a fort on the island of Nuku Hiva to protect three prize ships which had been captured from the British.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1814",
        "end_date":"",
        "content_text":"Spanish Florida: General Andrew Jackson took Pensacola and drove out the British forces.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1814",
        "end_date":"1825",
        "content_text":"Caribbean: Engagements between pirates and American ships or squadrons took place repeatedly especially ashore and offshore about Cuba, Puerto Rico, Santo Domingo, and Yucatan.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1822",
        "end_date":"",
        "content_text":"In 1822, Commodore James Biddle employed a squadron of two frigates, four sloops of war, two brigs, four schooners, and two gunboats in the West Indies.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1815",
        "end_date":"",
        "content_text":"Algiers: The Second Barbary War was declared against the United States by the Dey of Algiers of the Barbary states, an act not reciprocated by the United States.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1815",
        "end_date":"",
        "content_text":"Tripoli: After securing an agreement from Algiers, Captain Decatur demonstrated with his squadron at Tunis and Tripoli, where he secured indemnities for offenses during the War of 1812.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1816",
        "end_date":"",
        "content_text":"Spanish Florida: United States forces destroyed Negro Fort, which harbored fugitive slaves making raids into United States territory.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1816",
        "end_date":"1818",
        "content_text":"Spanish Florida - First Seminole War: The Seminole Indians, whose area was a haven for escaped slaves and border ruffians, were attacked by troops under General Jackson and General Edmund P. Gaines and pursued into northern Florida.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1819",
        "end_date":"",
        "content_text":"In 1819 the Floridas were ceded to the United States.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1817",
        "end_date":"",
        "content_text":"Amelia Island (Spanish territory off Florida): Under orders of President James Monroe, United States forces landed and expelled a group of smugglers, adventurers, and freebooters.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1818",
        "end_date":"",
        "content_text":"Oregon: The USS Ontario dispatched from Washington, which made a landing at the mouth of the Columbia River to assert US claims.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1820",
        "end_date":"1823",
        "content_text":"Africa: Naval units raided the slave traffic pursuant to the 1819 act of Congress.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1822",
        "end_date":"",
        "content_text":"Cuba: United States naval forces suppressing piracy landed on the northwest coast of Cuba and burned a pirate station.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1823",
        "end_date":"",
        "content_text":"Cuba: Brief landings in pursuit of pirates occurred April 8 near Escondido; April 16 near Cayo Blanco; July 11 at Siquapa Bay; July 21 at Cape Cruz; and October 23 at Camrioca.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1824",
        "end_date":"",
        "content_text":"Cuba: In October the USS Porpoise landed sailors near Matanzas in pursuit of pirates.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1824",
        "end_date":"",
        "content_text":"Puerto Rico (Spanish territory): Commodore David Porter with a landing party attacked the town of Fajardo which had sheltered pirates and insulted American naval officers.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1825",
        "end_date":"",
        "content_text":"Cuba: In March cooperating American and British forces landed at Sagua La Grande to capture pirates.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1827",
        "end_date":"",
        "content_text":"Greece:.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1831",
        "end_date":"1832",
        "content_text":"Falkland Islands: Captain Silas Duncan of the USS Lexington attacked, looted and burned the Argentine town of Puerto Soledad in Malvinas islands.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1832",
        "end_date":"",
        "content_text":"Attack on Quallah Battoo: Sumatra, Indonesia - February 6 to 9, U.S. forces under Commodore John Downes aboard the frigate USS Potomac landed and stormed a fort to punish natives of the town of Quallah Battoo for plundering the American cargo ship Friendship.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1833",
        "end_date":"",
        "content_text":"Argentina: October 31 to November 15, A force was sent ashore at Buenos Aires to protect the interests of the United States and other countries during an insurrection.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1835",
        "end_date":"1836",
        "content_text":"Peru: December 10, 1835 to January 24, 1836 and August 31 to December 7, 1836, Marines protected American interests in Callao and Lima during an attempted revolution.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1835",
        "end_date":"1842",
        "content_text":"Florida Territory: United States Navy supports the Army's efforts at quelling uprisings and attacks on civilians by Seminole Indians.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1838",
        "end_date":"",
        "content_text":"The Caroline affair on Navy Island, Canada: After the failure of the Upper Canada Rebellion of 1837 favoring Canadian democracy and independence from the British Empire; William Lyon Mackenzie and his rebels fled to Navy Island where they declared the Republic of Canada.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1838",
        "end_date":"1839",
        "content_text":"Sumatra (Indonesia): December 24, 1838 to January 4, 1839, A naval force landed to punish natives of the towns of Quallah Battoo and Muckie (Mukki) for depredations on American shipping.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1840",
        "end_date":"",
        "content_text":"Fiji Islands: In July, naval forces landed to punish natives for attacking American exploring and surveying parties.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1841",
        "end_date":"",
        "content_text":"McKean Island (Drummond Island/Taputenea), Gilbert Islands (Kingsmill Group), Pacific Ocean: A naval party landed to avenge the murder of a seaman by the natives.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1841",
        "end_date":"",
        "content_text":"Samoa: On February 24, a naval party landed and burned towns after the murder of an American seaman on Upolu.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1842",
        "end_date":"",
        "content_text":"Mexico: Commodore Thomas ap Catesby Jones, in command of a squadron long cruising off California, occupied Monterey, California, on October 19, believing war had come.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1843",
        "end_date":"",
        "content_text":"China: Sailors and marines from the St. Louis were landed after a clash between Americans and Chinese at the trading post in Canton.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1843",
        "end_date":"",
        "content_text":"Africa: From November 29 to December 16, four United States vessels demonstrated and landed various parties (one of 200 marines and sailors) to discourage piracy and the slave trade along the Ivory Coast, and to punish attacks by the natives on American seamen and shipping.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1844",
        "end_date":"",
        "content_text":"Mexico: President Tyler deployed U.S. forces to protect Texas against Mexico, pending Senate approval of a treaty of annexation (which was later rejected).",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1846",
        "end_date":"1848",
        "content_text":"Mexican-American War: On May 13, 1846, the United States recognized the existence of a state of war with Mexico.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1849",
        "end_date":"",
        "content_text":"Smyrna (zmir, Turkey): In July, a naval force gained release of an American seized by Austrian officials.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1851",
        "end_date":"",
        "content_text":"Ottoman Empire: After a massacre of foreigners (including Americans) at Jaffa in January, a demonstration by the Mediterranean Squadron was ordered along the Turkish (Levantine) coast.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1851",
        "end_date":"",
        "content_text":"Johanna Island (modern Anjouan, east of Africa): In August, forces from the U.S. sloop-of-war Dale exacted redress for the unlawful imprisonment of the captain of an American whaling brig.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1852",
        "end_date":"1853",
        "content_text":"Argentina: February 3 to 12, 1852; September 17, 1852 to April 1853: Marines were landed and maintained in Buenos Aires to protect American interests during a revolution.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1853",
        "end_date":"",
        "content_text":"Nicaragua: March 11 to 13, US forces landed to protect American lives and interests during political disturbances.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1853",
        "end_date":"1854",
        "content_text":"Japan: Commodore Matthew Perry and his expedition made a display of force leading to the \"opening of Japan\".",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1853",
        "end_date":"1854",
        "content_text":"Ryukyu and Bonin Islands (Japan): Commodore Matthew Perry on three visits before going to Japan and while waiting for a reply from Japan made a naval demonstration, landing marines twice, and secured a coaling concession from the ruler of Naha on Okinawa; he also demonstrated in the Bonin Islands with the purpose of securing facilities for commerce.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1854",
        "end_date":"",
        "content_text":"China: April 4 to June 17, American and English ships landed forces to protect American interests in and near Shanghai during Chinese civil strife.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1854",
        "end_date":"",
        "content_text":"Nicaragua: On July 9-15, naval forces bombarded and burned San Juan del Norte (Greytown) to avenge an insult to the American Minister to Nicaragua.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1855",
        "end_date":"",
        "content_text":"China: On May 19-21, U.S. forces protected American interests in Shanghai and, from August 3 to 5 fought pirates near Hong Kong.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1855",
        "end_date":"",
        "content_text":"Fiji Islands: From September 12 to November 4, an American naval force landed to seek reparations for attacks on American residents and seamen.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1855",
        "end_date":"",
        "content_text":"Uruguay: On November 25-29, United States and European naval forces landed to protect American interests during an attempted revolution in Montevideo.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1856",
        "end_date":"",
        "content_text":"Panama, Republic of New Grenada: On September 19-22, U.S. forces landed to protect American interests during an insurrection.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1856",
        "end_date":"",
        "content_text":"China: From October 22 to December 6, U.S. forces landed to protect American interests at Canton during hostilities between the British and the Chinese, and to avenge an assault upon an unarmed boat displaying the United States flag.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1857",
        "end_date":"1858",
        "content_text":"Utah War: The Utah War was a dispute between Mormon settlers in Utah Territory and the United States federal government.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1857",
        "end_date":"",
        "content_text":"Nicaragua: April to May, November to December.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1858",
        "end_date":"",
        "content_text":"Uruguay: From January 2 to 27, forces from two United States warships landed to protect American property during a revolution in Montevideo.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1858",
        "end_date":"",
        "content_text":"Fiji Islands: From October 6 to 16, a marine expedition with the USS Vandalia killed 14 natives and burned 115 huts in retaliation for the murder of two American citizens at Waya.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1858",
        "end_date":"1859",
        "content_text":"Ottoman Empire: The Secretary of State requested a display of naval force along the Levant after a massacre of Americans at Jaffa and mistreatment elsewhere \"to remind the authorities (of the Ottoman Empire) of the power of the United States.\".",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1859",
        "end_date":"",
        "content_text":"Paraguay: Congress authorized a naval squadron to seek redress for an attack on a naval vessel in the Parana River during 1855.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1859",
        "end_date":"",
        "content_text":"Mexico: Two hundred United States soldiers crossed the Rio Grande in pursuit of the Mexican nationalist Juan Cortina.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1859",
        "end_date":"",
        "content_text":"China: From July 31 to August 2, a naval force landed to protect American interests in Shanghai.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1860",
        "end_date":"",
        "content_text":"Angola, Portuguese West Africa: On March 1, American residents at Kissembo called upon American and British ships to protect lives and property during problems with natives.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1860",
        "end_date":"",
        "content_text":"Colombia, Bay of Panama: From September 27 to October 8, naval forces landed to protect American interests during a revolution.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1861",
        "end_date":"1865",
        "content_text":"American Civil War: A major war between the United States (the Union) and eleven Southern states which declared that they had a right to secession and formed the Confederate States of America.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1863",
        "end_date":"",
        "content_text":"Japan: July 16, Naval battle of Shimonoseki: The USS Wyoming retaliated against a firing on the American vessel Pembroke at Shimonoseki.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1864",
        "end_date":"",
        "content_text":"Japan: From July 14 to August 3, naval forces protected the United States Minister to Japan when he visited Yedo to negotiate concerning some American claims against Japan, and to make his negotiations easier by impressing the Japanese with American power.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1864",
        "end_date":"",
        "content_text":"Japan: From September 4 to 14, naval forces of the United States, Great Britain, France, and the Netherlands compelled Japan and the Prince of Nagato in particular to permit the Straits of Shimonoseki to be used by foreign shipping in accordance with treaties already signed.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1865",
        "end_date":"",
        "content_text":"Panama: On March 9 and 10, US forces protected the lives and property of American residents during a revolution.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1865",
        "end_date":"1877",
        "content_text":"Southern United States - Reconstruction following the American Civil War: The South is divided into five Union occupation districts under the Reconstruction Act.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1866",
        "end_date":"",
        "content_text":"Mexico: To protect American residents, General Sedgwick and 100 men in November obtained surrender of Matamoros, on the border state of Tamaulipas.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1866",
        "end_date":"",
        "content_text":"China: From June 20 to July 7, US forces punished an assault on the American consul at Newchwang.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1867",
        "end_date":"",
        "content_text":"Nicaragua: Marines occupied Managua and Leon.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1867",
        "end_date":"",
        "content_text":"Formosa (island of Taiwan): On June 13, a naval force landed and burned a number of huts to punish the murder of the crew of a wrecked American vessel.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1868",
        "end_date":"",
        "content_text":"Japan (Osaka, Hiolo, Nagasaki, Yokohama, and Negata): February 4 to 8, April 4 to May 12, June 12 and 13.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1868",
        "end_date":"",
        "content_text":"Uruguay: On February 7-8, and 19-26, US forces protected foreign residents and the customhouse during an insurrection at Montevideo.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1868",
        "end_date":"",
        "content_text":"Colombia: In April, US forces protected passengers and treasure in transit at Aspinwall during the absence of local police or troops on the occasion of the death of the President of Colombia.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1870",
        "end_date":"",
        "content_text":"Battle of Boca Teacapan: On June 17 and 18, US forces destroyed the pirate ship Forward, which had been run aground about 40 miles up the Teacapan Estuary in Mexico.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1870",
        "end_date":"",
        "content_text":"Kingdom of Hawaii: On September 21, US forces placed the American flag at half-mast upon the death of Queen Kalama, when the American consul at Honolulu would not assume responsibility for so doing.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1872",
        "end_date":"",
        "content_text":"Korea: Shinmiyangyo - June 10 to 12, A US naval force attacked and captured five forts to force stalled negotiations on trade agreements and to punish natives for depredations on Americans, particularly for executing the crew of the General Sherman and burning the schooner (which in turn happened because the crew had stolen food and kidnapped a Korean official), and for later firing on other American small boats taking soundings up the Salee River.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1873",
        "end_date":"",
        "content_text":"Colombia (Bay of Panama): May 7 to 22, September 23 to October 9.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1873",
        "end_date":"1896",
        "content_text":"Mexico: United States troops crossed the Mexican border repeatedly in pursuit of cattle thieves and other brigands.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1874",
        "end_date":"",
        "content_text":"Honolulu Courthouse Riot: From February 12 to 20, detachments from American vessels were landed to protect the interests of Americans living in the Kingdom of Hawaii during the coronation of a new king.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1876",
        "end_date":"",
        "content_text":"Mexico: On May 18, an American force was landed to police the town of Matamoros, Mexico, temporarily while it was without other government.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1878",
        "end_date":"",
        "content_text":"Lincoln County, New Mexico: On July 15-19, during the Battle of Lincoln (1878) (part of the Lincoln County War) 150 cavalry-men arrived from Fort Stanton, under the command of Lieutenant George Smith (later Colonel Nathan Dudley) to assist the Murphy-Dolan Faction in attacking the Lincoln County Regulators vigilante group.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1882",
        "end_date":"",
        "content_text":"Egyptian Expedition: July 14 to 18, American forces landed to protect American interests during warfare between British and Egyptians and looting of the city of Alexandria by Arabs.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1885",
        "end_date":"",
        "content_text":"Panama (Colon): January 18 and 19, US forces were used to guard the valuables in transit over the Panama Railroad, and the safes and vaults of the company during revolutionary activity.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1888",
        "end_date":"",
        "content_text":"Korea: June, A naval force was sent ashore to protect American residents in Seoul during unsettled political conditions, when an outbreak of the populace was expected.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1888",
        "end_date":"",
        "content_text":"Haiti: December 20, A display of force persuaded the Haitian Government to give up an American steamer which had been seized on the charge of breach of blockade.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1888",
        "end_date":"1889",
        "content_text":"Samoan crisis; First Samoan Civil War; Second Samoan Civil War: November 14, 1888 to March 20, 1889, US forces were landed to protect American citizens and the consulate during a native civil war.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1889",
        "end_date":"",
        "content_text":"Kingdom of Hawaii: July 30 and 31, US forces at Honolulu protected the interests of Americans living in Hawaii during an American led revolution.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1890",
        "end_date":"",
        "content_text":"Argentina: A naval party landed to protect US consulate and legation in Buenos Aires.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1890",
        "end_date":"",
        "content_text":"South Dakota: December 29, Soldiers of the US Army 7th Cavalry killed 178 Sioux Amerindians following an incident over a disarmament-inspection at a Lakota Sioux encampment near Wounded Knee Creek.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1891",
        "end_date":"",
        "content_text":"Haiti: US forces sought to protect American lives and property on Navassa Island.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1891",
        "end_date":"",
        "content_text":"Bering Sea Anti-Poaching Operations: July 2 to October 5, Naval forces sought to stop seal poaching.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1891",
        "end_date":"",
        "content_text":"Itata Incident: US and European naval forces intercepted and detained a shipment of arms sent to the Congressionalist forces in the Chilean Civil War.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1891",
        "end_date":"",
        "content_text":"Chile: August 28 to 30, US forces protected the American consulate and the women and children who had taken refuge in it during a revolution in Valparaso.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1892",
        "end_date":"",
        "content_text":"Homestead Strike: On July 6, Striking miners attack Pinkerton National Detective Agency agents attempting to break the strike by bringing non-union workers to the mine.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1892",
        "end_date":"",
        "content_text":"Wyoming: April 11 to April 13, U.S. Cavalry sent to breakup a gun battle at the TA Ranch.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1893",
        "end_date":"",
        "content_text":"Overthrow of the Hawaiian Kingdom: January 16 to April 1, Marines landed in Hawaii, ostensibly to protect American lives and property, but many believed actually to promote a provisional government under Sanford B. Dole.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1894",
        "end_date":"",
        "content_text":"Nicaragua: July 6 to August 7, US forces sought to protect American interests at Bluefields following a revolution.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1894",
        "end_date":"1895",
        "content_text":"China: Marines were stationed at Tientsin and penetrated to Peking for protection purposes during the First Sino-Japanese War.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1894",
        "end_date":"1895",
        "content_text":"China: A naval vessel was beached and used as a fort at Newchwang for protection of American nationals.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1894",
        "end_date":"1896",
        "content_text":"Korea: July 24, 1894 to April 3, 1896, A guard of marines was sent to protect the American legation and American lives and interests at Seoul during and following the Sino-Japanese War.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1895",
        "end_date":"",
        "content_text":"Colombia: March 8 and 9, US forces protected American interests during an attack on the town of Bocas del Toro by a bandit chieftain.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1896",
        "end_date":"",
        "content_text":"Nicaragua: May 2 to 4, US forces protected American interests in Corinto during political unrest.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1898",
        "end_date":"",
        "content_text":"Nicaragua: February 7 and 8, US forces protected American lives and property at San Juan del Sur.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1898",
        "end_date":"",
        "content_text":"Spanish-American War: On April 25, 1898, the United States declared war with Spain, ostensibly aligned with Cuban rebels.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1898",
        "end_date":"1899",
        "content_text":"Samoa: Second Samoan Civil War, a conflict that reached a head in 1898 when Germany, the United Kingdom, and the United States were locked in dispute over who should have control over the Samoan island chain.",
        "facet":"Oceania",
        "category":"Oceania"
    },
    {
        "start_date":"1898",
        "end_date":"1899",
        "content_text":"China: November 5, 1898 to March 15, 1899, US forces provided a guard for the legation at Peking and the consulate at Tientsin during contest between the Dowager Empress and her son.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1899",
        "end_date":"",
        "content_text":"Nicaragua: American and British naval forces were landed to protect national interests at San Juan del Norte, February 22 to March 5, and at Bluefields a few weeks later in connection with the insurrection of Gen. Juan P. Reyes.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1899",
        "end_date":"1913",
        "content_text":"Philippine Islands: Philippine-American War, US forces protected American interests following the war with Spain, defeating Filipino revolutionaries seeking immediate national independence.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1900",
        "end_date":"",
        "content_text":"China: From May 24 to September 28, Boxer Rebellion.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1901",
        "end_date":"",
        "content_text":"Colombia (State of Panama): From November 20 to December 4.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1902",
        "end_date":"",
        "content_text":"Colombia: From April 16 to 23, US forces protected American lives and property at Bocas del Toro during a civil war.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1902",
        "end_date":"",
        "content_text":"Colombia (State of Panama): From September 17 to November 18, the United States placed armed guards on all trains crossing the Isthmus to keep the railroad line open, and stationed ships on both sides of Panama to prevent the landing of Colombian troops.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1903",
        "end_date":"",
        "content_text":"Honduras: From March 23 to 30 or 31, US forces protected the American consulate and the steamship wharf at Puerto Cortes during a period of revolutionary activity.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1903",
        "end_date":"",
        "content_text":"Dominican Republic: From March 30 to April 21, a detachment of marines was landed to protect American interests in the city of Santo Domingo during a revolutionary outbreak.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1903",
        "end_date":"",
        "content_text":"Syria: From September 7 to 12, US forces protected the American consulate in Beirut when a local Muslim uprising was feared.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1903",
        "end_date":"1904",
        "content_text":"Abyssinia (Ethiopia): Twenty-five Marines were sent to Abyssinia to protect the US Consul General while he negotiated a treaty.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1903",
        "end_date":"1914",
        "content_text":"Panama: US forces sought to protect American interests and lives during and following the revolution for independence from Colombia over construction of the Isthmian Canal.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1904",
        "end_date":"",
        "content_text":"Dominican Republic: From January 2 to February 11, American and British naval forces established an area in which no fighting would be allowed and protected American interests in Puerto Plata and Sosua and Santo Domingo City during revolutionary fighting.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1904",
        "end_date":"",
        "content_text":"Tangier, Morocco: \"We want either Perdicaris alive or Raisuli dead.\" A squadron demonstrated to force release of a kidnapped American.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1904",
        "end_date":"",
        "content_text":"Panama: From November 17 to 24, U.S forces protected American lives and property at Ancon at the time of a threatened insurrection.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1904",
        "end_date":"1905",
        "content_text":"Korea: From January 5, 1904 to November 11, 1905, a guard of Marines was sent to protect the American legation in Seoul during the Russo-Japanese War.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1906",
        "end_date":"1909",
        "content_text":"Cuba: From September 1906 to January 23, 1909, US forces sought to protect interests and re-establish a government after revolutionary activity.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1907",
        "end_date":"",
        "content_text":"Honduras: From March 18 to June 8, to protect American interests during a war between Honduras and Nicaragua, troops were stationed in Trujillo, Ceiba, Puerto Cortes, San Pedro Sula, Laguna and Choloma.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1910",
        "end_date":"",
        "content_text":"Nicaragua: From May 19 to September 4, Occupation of Nicaragua.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1911",
        "end_date":"",
        "content_text":"Honduras: On January 26, American naval detachments were landed to protect American lives and interests during a civil war in Honduras.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1911",
        "end_date":"",
        "content_text":"China: As the Tongmenghui-led Xinhai Revolution approached, in October an ensign and 10 men tried to enter Wuchang to rescue missionaries but retired on being warned away, and a small landing force guarded American private property and consulate at Hankow.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1912",
        "end_date":"",
        "content_text":"Honduras: A small force landed to prevent seizure by the government of an American-owned railroad at Puerto Cortes.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1912",
        "end_date":"",
        "content_text":"Panama: Troops, on request of both political parties, supervised elections outside the Panama Canal Zone.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1912",
        "end_date":"",
        "content_text":"Cuba: From June 5 to August 5, U.S. forces protected American interests in Oriente Province and in Havana.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1912",
        "end_date":"",
        "content_text":"China: August 24-26, on Kentucky Island, and August 26-30 at Camp Nicholson.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1912",
        "end_date":"",
        "content_text":"Turkey: From November 18 to December 3, U.S. forces guarded the American legation at Constantinople during the First Balkan War.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1912",
        "end_date":"1925",
        "content_text":"Nicaragua: From August to November 1912, U.S. forces protected American interests during an attempted revolution.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1912",
        "end_date":"1941",
        "content_text":"China: The disorders which began with the overthrow of the dynasty during Kuomintang rebellion in 1912, which were redirected by the invasion of China by Japan, led to demonstrations and landing parties for the protection of U.S. interests in China continuously and at many points from 1912 on to 1941.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1927",
        "end_date":"",
        "content_text":"In 1927, the United States had 5,670 troops ashore in China and 44 naval vessels in its waters.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1933",
        "end_date":"",
        "content_text":"In 1933 the United States had 3,027 armed men ashore.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1858",
        "end_date":"1901",
        "content_text":"The protective action was generally based on treaties with China concluded from 1858 to 1901.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1913",
        "end_date":"",
        "content_text":"Mexico: From September 5 to 7, a few marines landed at Ciaris Estero to aid in evacuating American citizens and others from the Yaqui Valley, made dangerous for foreigners by civil strife.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1914",
        "end_date":"",
        "content_text":"Haiti: January 29 to February 9, February 20 and 21, October 19.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1914",
        "end_date":"",
        "content_text":"Dominican Republic: In June and July, during a revolutionary movement, United States naval forces by gunfire stopped the bombardment of Puerto Plata, and by threat of force maintained Santo Domingo City as a neutral zone.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1914",
        "end_date":"1917",
        "content_text":"Mexico: Tampico Affair led to Occupation of Veracruz, Mexico.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1915",
        "end_date":"1934",
        "content_text":"Haiti: From July 28, 1915 to August 15, 1934, United States occupation of Haiti.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1916",
        "end_date":"",
        "content_text":"China: American forces landed to quell a riot taking place on American property in Nanking.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1916",
        "end_date":"1924",
        "content_text":"Dominican Republic: From May 1916 to September 1924, Occupation of the Dominican Republic.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1917",
        "end_date":"",
        "content_text":"China: American troops were landed at Chungking to protect American lives during a political crisis.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1917",
        "end_date":"1918",
        "content_text":"World War I: On April 6, 1917, the United States declared war with Germany and on December 7, 1917, with Austria-Hungary.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1917",
        "end_date":"1922",
        "content_text":"Cuba: U.S. forces protected American interests during insurrection and subsequent unsettled conditions.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1918",
        "end_date":"1919",
        "content_text":"Mexico: After withdrawal of the Pershing expedition, U.S. troops entered Mexico in pursuit of bandits at least three times in 1918 and six times in 1919.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1918",
        "end_date":"1920",
        "content_text":"Panama: U.S. forces were used for police duty according to treaty stipulations, at Chiriqui, during election disturbances and subsequent unrest.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1918",
        "end_date":"1920",
        "content_text":"Russian SFSR: Marines were landed at and near Vladivostok in June and July to protect the American consulate and other points in the fighting between the Bolshevik troops and the Czech Army which had traversed Siberia from the western front.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1919",
        "end_date":"",
        "content_text":"Dalmatia (Croatia): U.S. forces were landed at Trau at the request of Italian authorities to police order between the Italians and Serbs.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1919",
        "end_date":"",
        "content_text":"Turkey: Marines from the USS Arizona were landed to guard the U.S. Consulate during the Greek occupation of Constantinople.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1919",
        "end_date":"",
        "content_text":"Honduras: From September 8 to 12, a landing force was sent ashore to maintain order in a neutral zone during an attempted revolution.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1920",
        "end_date":"",
        "content_text":"China: On March 14, a landing force was sent ashore for a few hours to protect lives during a disturbance at Kiukiang.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1920",
        "end_date":"",
        "content_text":"Guatemala: From April 9 to 27, U.S. forces protected the American Legation and other American interests, such as the cable station, during a period of fighting between Unionists and the Government of Guatemala.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1920",
        "end_date":"1922",
        "content_text":"Russia (Siberia): From February 16, 1920 to November 19, 1922, a Marine guard was sent to protect the United States radio station and property on Russian Island, Bay of Vladivostok.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1921",
        "end_date":"",
        "content_text":"Panama and Costa Rica: American naval squadrons demonstrated in April on both sides of the Isthmus to prevent war between the two countries over a boundary dispute.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1922",
        "end_date":"",
        "content_text":"Turkey: In September and October, a landing force was sent ashore with consent of both Greek and Turkish authorities, to protect American lives and property when the Turkish nationalists entered zmir (Smyrna).",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1922",
        "end_date":"1923",
        "content_text":"China: From April 1922 to November 1923, Marines were landed five times to protect Americans during periods of unrest.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1924",
        "end_date":"",
        "content_text":"Honduras: From February 28 to March 31, and from September 10 to 15, U.S. forces protected American lives and interests during election hostilities.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1924",
        "end_date":"",
        "content_text":"China: In September, Marines were landed to protect Americans and other foreigners in Shanghai during Chinese factional hostilities.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1925",
        "end_date":"",
        "content_text":"China: From January 15 to August 29, fighting of Chinese factions accompanied by riots and demonstrations in Shanghai brought the landing of American forces to protect lives and property in the International Settlement.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1925",
        "end_date":"",
        "content_text":"Honduras: From April 19 to 21, U.S. forces protected foreigners at La Ceiba during a political upheaval.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1925",
        "end_date":"",
        "content_text":"Panama: From October 12 to 23, strikes and rent riots led to the landing of about 600 American troops to keep order and protect American interests.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1926",
        "end_date":"1933",
        "content_text":"Nicaragua: From May 7 to June 5, 1926 and August 27, 1926 to January 3, 1933, the coup d'etat of General Chamorro aroused revolutionary activities leading to the landing of American marines to protect the interests of the United States.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1926",
        "end_date":"",
        "content_text":"China: In August and September, the Nationalist attack on Hankow brought the landing of American naval forces to protect American citizens.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1927",
        "end_date":"",
        "content_text":"China: In February, fighting at Shanghai caused presence American naval forces and marines to be increased.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1932",
        "end_date":"",
        "content_text":"China: American forces were landed to protect American interests during the Japanese occupation of Shanghai.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1932",
        "end_date":"",
        "content_text":"United States: \"Bonus Army\" of 17,000 WWI veterans plus 20,000 family cleared from Washington and then Anacostia flats \"Hooverville\" by 3rd Cavalry and 12th Infantry Regiments under Gen. Douglas MacArthur, July 28.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1933",
        "end_date":"",
        "content_text":"Cuba: During a revolution against President Gerardo Machado naval forces demonstrated but no landing was made.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1934",
        "end_date":"",
        "content_text":"China: Marines landed at Foochow to protect the American Consulate.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1940",
        "end_date":"",
        "content_text":"Newfoundland, Bermuda, St. Lucia, - Bahamas, Jamaica, Antigua, Trinidad, and British Guiana: Troops were sent to guard air and naval bases obtained under lease by negotiation with the United Kingdom.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1941",
        "end_date":"",
        "content_text":"Greenland: Greenland was taken under protection of the United States in April.",
        "facet":"North America",
        "category":"North America"
    },
    {
        "start_date":"1941",
        "end_date":"",
        "content_text":"Netherlands (Dutch Guiana): In November, the President ordered American troops to occupy Dutch Guiana, but by agreement with the Netherlands government in exile, Brazil cooperated to protect aluminum ore supply from the bauxite mines in Suriname.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1941",
        "end_date":"",
        "content_text":"Iceland: Iceland was taken under the protection of the United States, with consent of its government replacing British troops, for strategic reasons.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1941",
        "end_date":"",
        "content_text":"Germany: Sometime in the spring, the President ordered the Navy to patrol ship lanes to Europe.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1941",
        "end_date":"1945",
        "content_text":"World War II: On December 7, 1941, the United States declared war against Japan in response to the bombing of Pearl Harbor.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1941",
        "end_date":"1945",
        "content_text":"World War II",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1945",
        "end_date":"",
        "content_text":"China: In October 50,000 U.S. Marines were sent to North China to assist Chinese Nationalist authorities in disarming and repatriating the Japanese in China and in controlling ports, railroads, and airfields.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1945",
        "end_date":"1949",
        "content_text":"Occupation of part of Germany.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1945",
        "end_date":"1955",
        "content_text":"Occupation of part of Austria.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1945",
        "end_date":"1952",
        "content_text":"Occupation of Japan.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1944",
        "end_date":"1946",
        "content_text":"Temporary reoccupation of the Philippines during World War II and in preparation for previously scheduled independence.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1945",
        "end_date":"1947",
        "content_text":"U.S. Marines garrisoned in mainland China to oversee the removal of Soviet and Japanese forces after World War II.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1945",
        "end_date":"1949",
        "content_text":"Post-World War II occupation of South Korea; North Korean insurgency in Republic of Korea.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1946",
        "end_date":"",
        "content_text":"Trieste, (Italy): President Truman ordered the increase of US troops along the zonal occupation line and the reinforcement of air forces in northern Italy after Yugoslav forces shot down an unarmed US Army transport plane flying over Venezia Giulia.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1948",
        "end_date":"",
        "content_text":"Jerusalem (British Mandate): A Marine consular guard was sent to Jerusalem to protect the U.S. Consul General.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1948",
        "end_date":"",
        "content_text":"Berlin: Berlin Airlift After the Soviet Union established a land blockade of the U.S., British, and French sectors of Berlin on June 24, 1948, the United States and its allies airlifted supplies to Berlin until after the blockade was lifted in May 1949.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1948",
        "end_date":"1949",
        "content_text":"China: Marines were dispatched to Nanking to protect the American Embassy when the city fell to Communist troops, and to Shanghai to aid in the protection and evacuation of Americans.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1950",
        "end_date":"1953",
        "content_text":"Korean War: The United States responded to North Korean invasion of South Korea by going to its assistance, pursuant to United Nations Security Council resolutions.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1950",
        "end_date":"1955",
        "content_text":"Formosa (Taiwan): In June 1950, at the beginning of the Korean War, President Truman ordered the U.S.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1954",
        "end_date":"1955",
        "content_text":"China: Naval units evacuated U.S. civilians and military personnel from the Tachen Islands.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1955",
        "end_date":"1964",
        "content_text":"Vietnam: First military advisors sent to Vietnam on 12 Feb 1955.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1956",
        "end_date":"",
        "content_text":"Egypt: A marine battalion evacuated US nationals and other persons from Alexandria during the Suez Crisis.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1958",
        "end_date":"",
        "content_text":"Lebanon: 1958 Lebanon crisis, Marines were landed in Lebanon at the invitation of President Camille Chamoun to help protect against threatened insurrection supported from the outside.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1959",
        "end_date":"1960",
        "content_text":"The Caribbean: Second Marine Ground Task Force was deployed to protect U.S. nationals following the Cuban Revolution.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1959",
        "end_date":"1975",
        "content_text":"Vietnam War: U.S. military advisers had been in South Vietnam for a decade, and their numbers had been increased as the military position of the Saigon government became weaker.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1961",
        "end_date":"",
        "content_text":"Cuba: The Bay of Pigs Invasion, known in Hispanic America as Invasion de Baha de Cochinos (or Invasion de Playa Giron or Batalla de Giron), was an unsuccessful military invasion of Cuba undertaken by the CIA-sponsored paramilitary group Brigade 2506 on 17 April 1961.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1962",
        "end_date":"",
        "content_text":"Thailand: The Third Marine Expeditionary Unit landed on May 17, 1962 to support that country during the threat of Communist pressure from outside; by July 30, the 5,000 marines had been withdrawn.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1962",
        "end_date":"",
        "content_text":"Cuba: Cuban missile crisis, On October 22, President Kennedy instituted a \"quarantine\" on the shipment of offensive missiles to Cuba from the Soviet Union.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1962",
        "end_date":"1975",
        "content_text":"Laos: From October 1962 until 1975, the United States played an important role in military support of anti-Communist forces in Laos.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1964",
        "end_date":"",
        "content_text":"Congo (Zare): The United States sent four transport planes to provide airlift for Congolese troops during a rebellion and to transport Belgian paratroopers to rescue foreigners.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1965",
        "end_date":"",
        "content_text":"Invasion of Dominican Republic: Operation Power Pack, The United States intervened to protect lives and property during a Dominican revolt and sent 20,000 U.S. troops as fears grew that the revolutionary forces were coming increasingly under Communist control.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1967",
        "end_date":"",
        "content_text":"Israel: The USS Liberty incident, whereupon a United States Navy Technical Research Ship was attacked June 8, 1967 by Israeli armed forces, killing 34 and wounding more than 170 U.S. crew members.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1967",
        "end_date":"",
        "content_text":"Congo (Zare): The United States sent three military transport aircraft with crews to provide the Congo central government with logistical support during a revolt.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1968",
        "end_date":"",
        "content_text":"Laos & Cambodia: U.S. starts secret bombing campaign against targets along the Ho Chi Minh trail in the sovereign nations of Cambodia and Laos.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1970",
        "end_date":"",
        "content_text":"Cambodian Campaign: U.S. troops were ordered into Cambodia to clean out Communist sanctuaries from which Viet Cong and North Vietnamese attacked U.S. and South Vietnamese forces in Vietnam.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1972",
        "end_date":"",
        "content_text":"North Vietnam: Christmas bombing Operation Linebacker II (not mentioned in RL30172, but an operation leading to peace negotiations).",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1973",
        "end_date":"",
        "content_text":"Operation Nickel Grass, a strategic airlift operation conducted by the United States to deliver weapons and supplies to Israel during the Yom Kippur War.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1974",
        "end_date":"",
        "content_text":"Evacuation from Cyprus: United States naval forces evacuated U.S. civilians during the Turkish invasion of Cyprus.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1975",
        "end_date":"",
        "content_text":"Evacuation from Vietnam: Operation Frequent Wind, On April 3, 1975, President Ford reported U.S. naval vessels, helicopters, and Marines had been sent to assist in evacuation of refugees and US nationals from Vietnam.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1975",
        "end_date":"",
        "content_text":"Evacuation from Cambodia: Operation Eagle Pull, On April 12, 1975, President Ford reported that he had ordered U.S. military forces to proceed with the planned evacuation of U.S. citizens from Cambodia.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1975",
        "end_date":"",
        "content_text":"South Vietnam: On April 30, 1975, President Ford reported that a force of 70 evacuation helicopters and 865 Marines had evacuated about 1,400 U.S. citizens and 5,500 third country nationals and South Vietnamese from landing zones in and around the U.S. Embassy, Saigon and Tan Son Nhut Airport.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1975",
        "end_date":"",
        "content_text":"Cambodia: Mayaguez incident, On May 15, 1975, President Ford reported he had ordered military forces to retake the SS Mayaguez, a merchant vessel which was seized from Cambodian naval patrol boats in international waters and forced to proceed to a nearby island.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1976",
        "end_date":"",
        "content_text":"Lebanon: On July 22 and 23, 1976, helicopters from five U.S. naval vessels evacuated approximately 250 Americans and Europeans from Lebanon during fighting between Lebanese factions after an overland convoy evacuation had been blocked by hostilities.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1976",
        "end_date":"",
        "content_text":"Korea: Additional forces were sent to Korea after two American soldiers were killed by North Korean soldiers in the demilitarized zone between North and South Korea while cutting down a tree.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1978",
        "end_date":"",
        "content_text":"Zare (Congo): From May 19 through June, the United States utilized military transport aircraft to provide logistical support to Belgian and French rescue operations in Zare.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1980",
        "end_date":"",
        "content_text":"Iran: Operation Eagle Claw, on April 26, 1980, President Carter reported the use of six U.S. transport planes and eight helicopters in an unsuccessful attempt to rescue the American hostages in Iran.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1980",
        "end_date":"",
        "content_text":"U.S. Army and Air Force units arrive in the Sinai in September as part of \"Operation Bright Star\".",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1981",
        "end_date":"",
        "content_text":"El Salvador: After a guerrilla offensive against the government of El Salvador, additional U.S. military advisers were sent to El Salvador, bringing the total to approximately 55, to assist in training government forces in counterinsurgency.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1981",
        "end_date":"",
        "content_text":"Libya: First Gulf of Sidra incident, on August 19, 1981, U.S. planes based on the carrier USS Nimitz shot down two Libyan jets over the Gulf of Sidra after one of the Libyan jets had fired a heat-seeking missile.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1982",
        "end_date":"",
        "content_text":"Sinai: On March 19, 1982, President Reagan reported the deployment of military personnel and equipment to participate in the Multinational Force and Observers in the Sinai.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1982",
        "end_date":"",
        "content_text":"Lebanon: Multinational Force in Lebanon, on August 21, 1982, President Reagan reported the dispatch of 800 Marines to serve in the multinational force to assist in the withdrawal of members of the Palestine Liberation force from Beirut.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1982",
        "end_date":"1983",
        "content_text":"Lebanon: On September 29, 1982, President Reagan reported the deployment of 1200 marines to serve in a temporary multinational force to facilitate the restoration of Lebanese government sovereignty.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1983",
        "end_date":"",
        "content_text":"Egypt: After a Libyan plane bombed a city in Sudan on March 18, 1983, and Sudan and Egypt appealed for assistance, the United States dispatched an AWACS electronic surveillance plane to Egypt.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1983",
        "end_date":"",
        "content_text":"Grenada: Operation Urgent Fury, citing the increased threat of Soviet and Cuban influence and noting the development of an international airport following a coup d'etat and alignment with the Soviet Union and Cuba, the U.S. invades the island nation of Grenada.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1983",
        "end_date":"1989",
        "content_text":"Honduras: In July 1983, the United States undertook a series of exercises in Honduras that some believed might lead to conflict with Nicaragua.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1983",
        "end_date":"",
        "content_text":"Chad: On August 8, 1983, President Reagan reported the deployment of two AWACS electronic surveillance planes and eight F-15 fighter planes and ground logistical support forces to assist Chad against Libyan and rebel forces.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1984",
        "end_date":"",
        "content_text":"Persian Gulf: On June 5, 1984, Saudi Arabian jet fighter planes, aided by intelligence from a U.S. AWACS electronic surveillance aircraft and fueled by a U.S. KC-10 tanker, shot down two Iranian fighter planes over an area of the Persian Gulf proclaimed as a protected zone for shipping.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1985",
        "end_date":"",
        "content_text":"Italy: On October 10, 1985, U.S. Navy pilots intercepted an Egyptian airliner and forced it to land in Sicily.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1986",
        "end_date":"",
        "content_text":"Action in the Gulf of Sidra (1986), on March 26, 1986, President Reagan reported on March 24 and 25, U.S. forces, while engaged in freedom of navigation exercises around the Gulf of Sidra, had been attacked by Libyan missiles and the United States had responded with missiles.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1986",
        "end_date":"",
        "content_text":"Libya: Operation El Dorado Canyon, on April 16, 1986, President Reagan reported that U.S. air and naval forces had conducted bombing strikes on terrorist facilities and military installations in the Libyan capitol of Tripoli, claiming that Libyan leader Col. Muammar Gaddafi was responsible for a bomb attack at a German disco that killed two U.S. soldiers.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1986",
        "end_date":"",
        "content_text":"Bolivia: U.S. Army personnel and aircraft assisted Bolivia in anti-drug operations.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1987",
        "end_date":"",
        "content_text":"Persian Gulf: USS Stark was struck on May 17 by two Exocet antiship missiles fired from a Dassault Mirage F1 of the Iraqi Air Force during the Iran-Iraq War, killing 37 U.S. Navy sailors.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1987",
        "end_date":"",
        "content_text":"Persian Gulf: Operation Nimble Archer.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1987",
        "end_date":"1988",
        "content_text":"Persian Gulf: Operation Earnest Will.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1987",
        "end_date":"1988",
        "content_text":"Persian Gulf: Operation Prime Chance was a United States Special Operations Command operation intended to protect U.S.-flagged oil tankers from Iranian attack during the Iran-Iraq War.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1988",
        "end_date":"",
        "content_text":"Persian Gulf: Operation Praying Mantis was the April 18, 1988 action waged by U.S. naval forces in retaliation for the Iranian mining of the Persian Gulf and the subsequent damage to an American warship.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1988",
        "end_date":"",
        "content_text":"Honduras: Operation Golden Pheasant was an emergency deployment of U.S. troops to Honduras in 1988, as a result of threatening actions by the forces of the (then socialist) Nicaraguans.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1988",
        "end_date":"",
        "content_text":"USS Vincennes shoot-down of Iran Air Flight 655.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1988",
        "end_date":"",
        "content_text":"Panama: In mid-March and April 1988, during a period of instability in Panama and as the United States increased pressure on Panamanian head of state General Manuel Noriega to resign, the United States sent 1,000 troops to Panama, to \"further safeguard the canal, US lives, property and interests in the area.\" The forces supplemented 10,000 U.S. military personnel already in the Panama Canal Zone.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1989",
        "end_date":"",
        "content_text":"Libya: Second Gulf of Sidra incident.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1989",
        "end_date":"",
        "content_text":"Panama: On May 11, 1989, in response to General Noriega's disregard of the results of the Panamanian election, President Bush ordered a brigade-sized force of approximately 1,900 troops to augment the estimated 1,000 U.S. forces already in the area.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1989",
        "end_date":"",
        "content_text":"Colombia, Bolivia, and Peru: Andean Initiative in War on Drugs, On September 15, 1989, President Bush announced that military and law enforcement assistance would be sent to help the Andean nations of Colombia, Bolivia, and Peru combat illicit drug producers and traffickers.",
        "facet":"South America",
        "category":"South America"
    },
    {
        "start_date":"1989",
        "end_date":"",
        "content_text":"Philippines: Operation Classic Resolve, On December 2, 1989, President Bush reported that on December 1, Air Force fighters from Clark Air Base in Luzon had assisted the Aquino government to repel a coup attempt.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1989",
        "end_date":"1990",
        "content_text":"Panama: United States invasion of Panama and Operation Just Cause, On December 21, 1989, President Bush reported that he had ordered U.S. military forces to Panama to protect the lives of American citizens and bring General Noriega to justice.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1990",
        "end_date":"",
        "content_text":"The Panamanian head of state, General Manuel Noriega, was captured and brought to the U.S.  Liberia: On August 6, 1990, President Bush reported that a reinforced rifle company had been sent to provide additional security to the U.S. Embassy in Monrovia, and that helicopter teams had evacuated U.S. citizens from Liberia.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1990",
        "end_date":"",
        "content_text":"Saudi Arabia: On August 9, 1990, President Bush reported that he launched Operation Desert Shield by ordering the forward deployment of substantial elements of the U.S. armed forces into the Persian Gulf region to help defend Saudi Arabia after the August 2 invasion of Kuwait by Iraq.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1991",
        "end_date":"",
        "content_text":"Iraq and Kuwait: Gulf War, On January 16, 1991, in response to the refusal by Iraq to leave Kuwait, U.S. and Coalition aircraft attacked Iraqi forces and military targets in Iraq and Kuwait in conjunction with a coalition of allies and under United Nations Security Council resolutions.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1991",
        "end_date":"1996",
        "content_text":"Iraq: Operation Provide Comfort, Delivery of humanitarian relief and military protection for Kurds fleeing their homes in northern Iraq during the 1991 uprising, by a small Allied ground force based in Turkey which began in April 1991.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1991",
        "end_date":"",
        "content_text":"Iraq: On May 17, 1991, President Bush stated that the Iraqi repression of the Kurdish people had necessitated a limited introduction of U.S. forces into northern Iraq for emergency relief purposes.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1991",
        "end_date":"",
        "content_text":"Zaire: On September 25-27, 1991, after widespread looting and rioting broke out in Kinshasa, Air Force C-141s transported 100 Belgian troops and equipment into Kinshasa.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1992",
        "end_date":"",
        "content_text":"Sierra Leone: Operation Silver Anvil, Following the April 29 coup that overthrew President Joseph Saidu Momoh, a United States European Command (USEUCOM) Joint Special Operations Task Force evacuated 438 people (including 42 Third Country nationals) on May 3.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1992",
        "end_date":"1996",
        "content_text":"Bosnia and Herzegovina: Operation Provide Promise was a humanitarian relief operation in Bosnia and Herzegovina during the Yugoslav Wars, from July 2, 1992, to January 9, 1996, which made it the longest running humanitarian airlift in history.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1992",
        "end_date":"",
        "content_text":"Kuwait: On August 3, 1992, the United States began a series of military exercises in Kuwait, following Iraqi refusal to recognize a new border drawn up by the United Nations and refusal to cooperate with UN inspection teams.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1992",
        "end_date":"2003",
        "content_text":"Iraq: Iraqi no-fly zones, The U.S., United Kingdom, and its Gulf War allies declared and enforced \"no-fly zones\" over the majority of sovereign Iraqi airspace, prohibiting Iraqi flights in zones in southern Iraq and northern Iraq, conducting aerial reconnaissance, and several specific attacks on Iraqi air-defense systems as part of the UN mandate.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1992",
        "end_date":"1995",
        "content_text":"Somalia: Operation Restore Hope, Somali Civil War: On December 10, 1992, President Bush reported that he had deployed U.S. armed forces to Somalia in response to a humanitarian crisis and a UN Security Council Resolution in support for UNITAF.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1993",
        "end_date":"1995",
        "content_text":"Bosnia: Operation Deny Flight, On April 12, 1993, in response to a United Nations Security Council passage of Resolution 816, U.S. and NATO enforced the no-fly zone over the Bosnian airspace, prohibited all unauthorized flights and allowed to \"take all necessary measures to ensure compliance with .\".",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1993",
        "end_date":"",
        "content_text":"Macedonia: On July 9, 1993, President Clinton reported the deployment of 350 U.S. soldiers to the Republic of Macedonia to participate in the UN Protection Force to help maintain stability in the area of former Yugoslavia.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1994",
        "end_date":"",
        "content_text":"Bosnia: Banja Luka incident, NATO become involved in the first combat situation when NATO U.S. Air Force F-16 jets shot down four of the six Bosnian Serb J-21 Jastreb single-seat light attack jets for violating UN-mandated no-fly zone.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1994",
        "end_date":"1995",
        "content_text":"Haiti: Operation Uphold Democracy, U.S. ships had begun embargo against Haiti.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"1994",
        "end_date":"",
        "content_text":"Macedonia: On April 19, 1994, President Clinton reported that the U.S. contingent in Macedonia had been increased by a reinforced company of 200 personnel.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1995",
        "end_date":"",
        "content_text":"Bosnia: Operation Deliberate Force, On August 30, 1995, U.S. and NATO aircraft began a major bombing campaign of Bosnian Serb Army in response to a Bosnian Serb mortar attack on a Sarajevo market that killed 37 people on August 28, 1995.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1996",
        "end_date":"",
        "content_text":"Liberia: Operation Assured Response, On April 11, 1996, President Clinton reported that on April 9, 1996 due to the :\"deterioration of the security situation and the resulting threat to American citizens\" in Liberia he had ordered U.S. military forces to evacuate from that country \"private U.S. citizens and certain third-country nationals who had taken refuge in the U.S. Embassy compound.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1996",
        "end_date":"",
        "content_text":"Central African Republic, Operation Quick Response: On May 23, 1996, President Clinton reported the deployment of U.S. military personnel to Bangui, Central African Republic, to conduct the evacuation from that country of \"private U.S. citizens and certain U.S. government employees\", and to provide \"enhanced security for the American Embassy in Bangui.\" United States Marine Corps elements of Joint Task Force Assured Response, responding in nearby Liberia, provided security to the embassy and evacuated 448 people, including between 190 and 208 Americans.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1996",
        "end_date":"",
        "content_text":"Kuwait: Operation Desert Strike, American Air Strikes in the north to protect the Kurdish population against the Iraqi Army attacks.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1996",
        "end_date":"",
        "content_text":"Bosnia: Operation Joint Guard, On December 21, 1996, U.S. and NATO established the SFOR peacekeepers to replace the IFOR in enforcing the peace under the Dayton agreement.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1997",
        "end_date":"",
        "content_text":"Albania: Operation Silver Wake, On March 13, 1997, U.S. military forces were used to evacuate certain U.S. government employees and private U.S. citizens from Tirana, Albania.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"1997",
        "end_date":"",
        "content_text":"Congo and Gabon: On March 27, 1997, President Clinton reported on March 25, 1997, a standby evacuation force of U.S. military personnel had been deployed to Congo and Gabon to provide enhanced security and to be available for any necessary evacuation operation.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1997",
        "end_date":"",
        "content_text":"Sierra Leone: On May 29 and May 30, 1997, U.S. military personnel were deployed to Freetown, Sierra Leone, to prepare for and undertake the evacuation of certain U.S. government employees and private U.S. citizens.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1997",
        "end_date":"",
        "content_text":"Cambodia: On July 11, 1997, In an effort to ensure the security of American citizens in Cambodia during a period of domestic conflict there, a Task Force of about 550 U.S. military personnel were deployed at Utapao Air Base in Thailand for possible evacuations.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1998",
        "end_date":"",
        "content_text":"Iraq: Operation Desert Fox, U.S. and British forces conduct a major four-day bombing campaign from December 16-19, 1998 on Iraqi targets.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1998",
        "end_date":"",
        "content_text":"Guinea-Bissau: Operation Shepherd Venture, On June 10, 1998, in response to an army mutiny in Guinea-Bissau endangering the U.S. Embassy, President Clinton deployed a standby evacuation force of U.S. military personnel to Dakar, Senegal, to evacuate from the city of Bissau.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1998",
        "end_date":"1999",
        "content_text":"Kenya and Tanzania: U.S. military personnel were deployed to Nairobi, Kenya, to coordinate the medical and disaster assistance related to the bombing of the U.S. Embassies in Kenya and Tanzania.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1998",
        "end_date":"",
        "content_text":"Afghanistan and Sudan: Operation Infinite Reach, On August 20, President Clinton ordered a cruise missile attack against two suspected terrorist training camps in Afghanistan and a suspected chemical factory in Sudan.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"1998",
        "end_date":"",
        "content_text":"Liberia: On September 27, 1998, America deployed a stand-by response and evacuation force of 30 U.S. military personnel to increase the security force at the U.S. Embassy in Monrovia.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"1999",
        "end_date":"2001",
        "content_text":"East Timor: Limited number of U.S. military forces deployed with the United Nations-mandated International Force for East Timor restore peace to East Timor.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"1999",
        "end_date":"",
        "content_text":"Serbia: Operation Allied Force: U.S. and NATO aircraft began a major bombing of Serbia and Serb positions in Kosovo on March 24, 1999, during the Kosovo War due to the refusal by Serbian President Slobodan Miloevi to end repression against ethnic Albanians in Kosovo.",
        "facet":"Europe",
        "category":"Europe"
    },
    {
        "start_date":"2000",
        "end_date":"",
        "content_text":"Sierra Leone: On May 12, 2000, a U.S. Navy patrol craft deployed to Sierra Leone to support evacuation operations from that country if needed.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2000",
        "end_date":"",
        "content_text":"Nigeria: Special Forces troops are sent to Nigeria to lead a training mission in the county.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2000",
        "end_date":"",
        "content_text":"Yemen: On October 12, 2000, after the USS Cole attack in the port of Aden, Yemen, military personnel were deployed to Aden.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2000",
        "end_date":"",
        "content_text":"East Timor: On February 25, 2000, a small number of U.S. military personnel were deployed to support the United Nations Transitional Administration in East Timor (UNTAET).",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"2001",
        "end_date":"",
        "content_text":"On April 1, 2001, a mid-air collision between a United States Navy EP-3E ARIES II signals surveillance aircraft and a People's Liberation Army Navy (PLAN) J-8II interceptor fighter jet resulted in an international dispute between the United States and the People's Republic of China called the Hainan Island incident.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"2002",
        "end_date":"",
        "content_text":"Yemen: On November 3, 2002, an American MQ-1 Predator fired a Hellfire missile at a car in Yemen killing Qaed Salim Sinan al-Harethi, an al-Qaeda leader thought to be responsible for the USS Cole bombing.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2002",
        "end_date":"",
        "content_text":"Philippines: OEF-Philippines, As of January, U.S. \"combat-equipped and combat support forces\" have been deployed to the Philippines to train with, assist and advise the Philippines' Armed Forces in enhancing their \"counterterrorist capabilities.\".",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"2002",
        "end_date":"",
        "content_text":"Cote d'Ivoire: On September 25, 2002, in response to a rebellion in Cote d'Ivoire, U.S. military personnel went into Cote d'Ivoire to assist in the evacuation of American citizens from Bouake.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2003",
        "end_date":"2011",
        "content_text":"War in Iraq: Operation Iraqi Freedom, March 20, 2003, The United States leads a coalition that includes the United Kingdom, Australia and Poland to invade Iraq with the stated goal being \"to disarm Iraq in pursuit of peace, stability, and security both in the Gulf region and in the United States.\".",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2003",
        "end_date":"",
        "content_text":"Liberia: Second Liberian Civil War, On June 9, 2003, President Bush reported that on June 8 he had sent about 35 U.S. Marines into Monrovia, Liberia, to help secure the U.S. Embassy in Nouakchott, Mauritania, and to aid in any necessary evacuation from either Liberia or Mauritania.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2003",
        "end_date":"",
        "content_text":"Georgia and Djibouti: \"US combat equipped and support forces\" had been deployed to Georgia and Djibouti to help in enhancing their \"counterterrorist capabilities.\" .",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2004",
        "end_date":"",
        "content_text":"Haiti: 2004 Haitian coup d'etat occurs, The US first sent 55 combat equipped military personnel to augment the U.S. Embassy security forces there and to protect American citizens and property in light.",
        "facet":"Central America and the Caribbean",
        "category":"Central America and the Caribbean"
    },
    {
        "start_date":"2004",
        "end_date":"",
        "content_text":"War on Terror: U.S. anti-terror related activities were underway in Georgia, Djibouti, Kenya, Ethiopia, Yemen, and Eritrea.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2005",
        "end_date":"2006",
        "content_text":"Pakistan: President Bush deploys troops from US Army Air Cav Brigades to provide Humanitarian relief to far remote villages in the Kashmir mountain ranges of Pakistan stricken by a massive earthquake.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2007",
        "end_date":"",
        "content_text":"The Mogadishu Encounter, on November 4, 2007, Somali Pirate's boarded and attacked a North Korean merchant vessel.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2007",
        "end_date":"",
        "content_text":"Somalia: Battle of Ras Kamboni, On January 8, 2007, while the conflict between the Islamic Courts Union and the Transitional Federal Government continues, an AC-130 gunship conducts an aerial strike on a suspected al-Qaeda operative, along with other Islamist fighters, on Badmadow Island near Ras Kamboni in southern Somalia.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2008",
        "end_date":"",
        "content_text":"South Ossetia, Georgia: Helped Georgia humanitarian aid,  helped to transport Georgian forces from Iraq during the conflict.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2010",
        "end_date":"2011",
        "content_text":"Operation New Dawn, On February 17, 2010, U.S. Secretary of Defense Robert Gates announced that as of September 1, 2010, the name \"Operation Iraqi Freedom\" would be replaced by \"Operation New Dawn\".",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2011",
        "end_date":"2011",
        "content_text":"2011 military intervention in Libya: Operation Odyssey Dawn, United States and coalition enforcing U.N. Security Council Resolution 1973 with bombings of Libyan forces.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2011",
        "end_date":"",
        "content_text":"Osama Bin Laden is killed by U.S. military forces in Pakistan as part of Operation Neptune Spear.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2011",
        "end_date":"",
        "content_text":"Drone strikes on al-Shabab militants begin in Somalia.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2012",
        "end_date":"",
        "content_text":"Jordan: 150 U.S. troops deployed to Jordan to help it contain the Syrian Civil War within Syria's borders.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2012",
        "end_date":"",
        "content_text":"Turkey: 400 troops and two batteries of Patriot missiles sent to Turkey to prevent any missile strikes from Syria.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2012",
        "end_date":"",
        "content_text":"Chad: 50 U.S. troops have deployed to the African country of Chad to help evacuate U.S. citizens and embassy personnel from the neighboring Central African Republic's capital of Bangui in the face of rebel advances toward the city.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2013",
        "end_date":"",
        "content_text":"Mali: U.S. forces assisted the French in Operation Serval with air refueling and transport aircraft.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2013",
        "end_date":"",
        "content_text":"Somalia: U.S. Air Force planes supported the French in the Bulo Marer hostage rescue attempt.",
        "facet":"Sub-Saharan Africa",
        "category":"Sub-Saharan Africa"
    },
    {
        "start_date":"2013",
        "end_date":"2013",
        "content_text":"2013 Korean crisis.",
        "facet":"Asia",
        "category":"Asia"
    },
    {
        "start_date":"2013",
        "end_date":"",
        "content_text":"Navy SEALs conducted a raid in Somalia and possibly killed a senior Al-Shabaab official, simultaneously another raid took place in Tripoli, Libya, where Special Operations Forces captured Abu Anas al Libi (also known as Anas al-Libi).",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2014",
        "end_date":"2014",
        "content_text":"2014 American rescue mission in Syria: The U.S attempted to rescue James Foley and other hostages being held by ISIL.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2014",
        "end_date":"2014",
        "content_text":"2014 Yemen hostage rescue operations against al-Qaeda: On November 25th, U.S Navy SEAL's and Yemeni Special Forces launched an operations in Yemen in attempt to rescue eight hostages that were being held by al-Qaeda.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    },
    {
        "start_date":"2015",
        "end_date":"",
        "content_text":"April 30th, 2015 U.S. sends ships to the Strait of Hormuz to shield vessels after Iranian Seizure of commercial vessel: The U.S. Navy deploys warships to protect American commercial vessels passing through the Strait of Hormuz from Iranian interference.",
        "facet":"Middle East and North Africa",
        "category":"Middle East and North Africa"
    }
]
